<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">
  <Namespace id="_1" name="::" members="_3 _4 _5 _6 _8 _10 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _38 _39 _40 _41 _43 _44 _46 _47 _48 _49 _50 _51 _52 _53 _54 _55 _56 _57 _42 _58 _59 _60 _62 _11 _64 _65 _67 _68 _70 _71 _73 _74 _75 _76 _77 _78 _79 _80 _81 _82 _83 _84 _85 _86 _87 _88 _90 _91 _92 _93 _94 _95 _96 _97 _98 _99 _101 _102 _103 _104 _72 _105 _106 _107 _108 _109 _110 _111 _112 _113 _114 _115 _116 _117 _118 _119 _120 _121 _122 _123 _124 _125 _126 _127 _128 _129 _130 _131 _132 _134 _135 _136 _137 _138 _139 _140 _141 _142 _143 _144 _145 _146 _147 _148 _149 _151 _152 _153 _2 _154 _155 _156 _157 _158 _159 _160 _161 _162 _150 _163 _164 _165 _166 _167 _168 _169 _170 _171 _172 _173 _174 _175 _176 _177 _178 _179 _180 _182 _183 _184 _186 _187 _188 _189 _190 _191 _192 _193 _194 _195 _196 _197 _198 _7 _199 _200 _201 _202 _203 _204 _205 _206 _207 _208 _209 _210 _211 _212 _213 _214 _215 _216 _217 _218 _219 _220 _221 _222 _223 _224 _225 _66 _226 _89 _227 _228 _229 _230 _231 _232 _233 _234 _235 _236 _237 _238 " mangled="_Z2::" demangled="::"/>
  <Namespace id="_2" name="std" context="_1" members="" mangled="_Z3std" demangled="std"/>
  <Function id="_3" name="__builtin_nans" returns="_239" context="_1" location="f0:21" file="f0" line="21" extern="1" attributes="nothrow const nonnull">
    <Argument name="str" type="_240" location="f0:21" file="f0" line="21"/>
  </Function>

    <EnumValue name="VPX_CODEC_MEM_ERROR" init="2"/>
    <EnumValue name="VPX_CODEC_ABI_MISMATCH" init="3"/>
    <EnumValue name="VPX_CODEC_INCAPABLE" init="4"/>
    <EnumValue name="VPX_CODEC_UNSUP_BITSTREAM" init="5"/>
    <EnumValue name="VPX_CODEC_UNSUP_FEATURE" init="6"/>
    <EnumValue name="VPX_CODEC_CORRUPT_FRAME" init="7"/>
    <EnumValue name="VPX_CODEC_INVALID_PARAM" init="8"/>
    <EnumValue name="VPX_CODEC_LIST_END" init="9"/>
  </Enumeration>
  <Function id="_215" name="__builtin_ceilf" returns="_241" context="_1" mangled="ceilf" location="f0:37" file="f0" line="37" extern="1" attributes="nothrow const">
    <Argument type="_241" location="f0:37" file="f0" line="37"/>
  </Function>
  <Function id="_216" name="__builtin_ceill" returns="_242" context="_1" mangled="ceill" location="f0:38" file="f0" line="38" extern="1" attributes="nothrow const">
    <Argument type="_242" location="f0:38" file="f0" line="38"/>
  </Function>
  <Function id="_217" name="vpx_codec_control_" returns="_214" context="_1" location="f1:375" file="f1" line="375" extern="1">
    <Argument name="ctx" type="_275" location="f1:375" file="f1" line="375"/>
    <Argument name="ctrl_id" type="_45" location="f1:375" file="f1" line="375"/>
    <Ellipsis/>
  </Function>
  <Function id="_218" name="__builtin_csinf" returns="_258" context="_1" mangled="csinf" location="f0:114" file="f0" line="114" extern="1" attributes="nothrow pure no vops">
    <Argument type="_258" location="f0:114" file="f0" line="114"/>
  </Function>
  <Function id="_219" name="__builtin_csinh" returns="_262" context="_1" mangled="csinh" location="f0:118" file="f0" line="118" extern="1" attributes="nothrow pure no vops">
    <Argument type="_262" location="f0:118" file="f0" line="118"/>
  </Function>
  <Function id="_220" name="__builtin_csinl" returns="_259" context="_1" mangled="csinl" location="f0:116" file="f0" line="116" extern="1" attributes="nothrow pure no vops">
    <Argument type="_259" location="f0:116" file="f0" line="116"/>
  </Function>
  <Function id="_221" name="__builtin_acos" returns="_239" context="_1" mangled="acos" location="f0:24" file="f0" line="24" extern="1" attributes="nothrow">
    <Argument type="_239" location="f0:24" file="f0" line="24"/>
  </Function>
  <Function id="_222" name="__builtin_ctzll" returns="_45" context="_1" location="f0:98" file="f0" line="98" extern="1" attributes="nothrow const">
    <Argument type="_37" location="f0:98" file="f0" line="98"/>
  </Function>
  <Typedef id="_223" name="uint_fast32_t" type="_100" context="_1" location="f3:53" file="f3" line="53"/>
  <Function id="_224" name="__builtin_cargf" returns="_241" context="_1" mangled="cargf" location="f0:93" file="f0" line="93" extern="1" attributes="nothrow pure no vops">
    <Argument type="_258" location="f0:93" file="f0" line="93"/>
  </Function>
  <Function id="_225" name="__builtin_cargl" returns="_242" context="_1" mangled="cargl" location="f0:95" file="f0" line="95" extern="1" attributes="nothrow pure no vops">
    <Argument type="_259" location="f0:95" file="f0" line="95"/>
  </Function>
  <Function id="_226" name="imaxabs" returns="_183" context="_1" location="f2:235" file="f2" line="235" extern="1" attributes="nothrow const __cdecl__">
    <Argument type="_183" location="f2:235" file="f2" line="235"/>
  </Function>
  <Function id="_227" name="__builtin_cosf" returns="_241" context="_1" mangled="cosf" location="f0:40" file="f0" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_241" location="f0:40" file="f0" line="40"/>
  </Function>
  <Function id="_228" name="__builtin_cosh" returns="_239" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow">
    <Argument type="_239" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_229" name="__builtin_cosl" returns="_242" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_242" location="f0:44" file="f0" line="44"/>
  </Function>
  <Function id="_230" name="__builtin_isgreater" returns="_249" context="_1" location="f0:137" file="f0" line="137" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Typedef id="_231" name="uint_least8_t" type="_185" context="_1" location="f3:39" file="f3" line="39"/>
  <Function id="_232" name="vpx_codec_iface_name" returns="_240" context="_1" location="f1:277" file="f1" line="277" extern="1">
    <Argument name="iface" type="_310" location="f1:277" file="f1" line="277"/>
  </Function>
  <Function id="_233" name="__builtin_sinf" returns="_241" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_241" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_234" name="__builtin_sinh" returns="_239" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_239" location="f0:77" file="f0" line="77"/>
  </Function>
  <Function id="_235" name="__builtin_sinl" returns="_242" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_242" location="f0:80" file="f0" line="80"/>
  </Function>
  <Typedef id="_236" name="uint64_t" type="_9" context="_1" location="f3:30" file="f3" line="30"/>
  <Function id="_237" name="__builtin_csin" returns="_262" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_262" location="f0:115" file="f0" line="115"/>
  </Function>
  <Typedef id="_238" name="vpx_img_fmt_t" type="_83" context="_1" location="f4:60" file="f4" line="60"/>
  <FundamentalType id="_239" name="double" size="64" align="64"/>
  <PointerType id="_240" type="_333c" size="32" align="32"/>
  <FundamentalType id="_241" name="float" size="32" align="32"/>
  <FundamentalType id="_242" name="long double" size="96" align="32"/>
  <Field id="_243" name="quot" type="_183" offset="0" context="_7" access="public" location="f2:231" file="f2" line="231"/>
  <Field id="_244" name="rem" type="_183" offset="64" context="_7" access="public" location="f2:232" file="f2" line="232"/>
  <Destructor id="_245" name="$_0" artificial="1" throw="" context="_7" access="public" mangled="_ZN9imaxdiv_tD1Ev *INTERNAL* " demangled="imaxdiv_t::~imaxdiv_t()" location="f2:233" file="f2" line="233" endline="233" inline="1">
  </Destructor>
  <OperatorMethod id="_246" name="=" returns="_335" artificial="1" throw="" context="_7" access="public" mangled="_ZN9imaxdiv_taSERKS_" demangled="imaxdiv_t::operator=(imaxdiv_t const&amp;)" location="f2:233" file="f2" line="233" endline="233" inline="1">
    <Argument type="_336" location="f2:230" file="f2" line="230"/>
  </OperatorMethod>
  <Constructor id="_247" name="$_0" artificial="1" throw="" context="_7" access="public" mangled="_ZN9imaxdiv_tC1ERKS_ *INTERNAL* " demangled="imaxdiv_t::imaxdiv_t(imaxdiv_t const&amp;)" location="f2:233" file="f2" line="233" endline="233" inline="1">
    <Argument type="_336" location="f2:230" file="f2" line="230"/>
  </Constructor>
  <Constructor id="_248" name="$_0" artificial="1" throw="" context="_7" access="public" mangled="_ZN9imaxdiv_tC1Ev *INTERNAL* " demangled="imaxdiv_t::imaxdiv_t()" location="f2:233" file="f2" line="233" inline="1"/>
  <FundamentalType id="_249" name="bool" size="8" align="8"/>
  <Field id="_250" name="x" type="_100" offset="0" context="_11" access="public" location="f4:146" file="f4" line="146"/>
  <Field id="_251" name="y" type="_100" offset="32" context="_11" access="public" location="f4:147" file="f4" line="147"/>
  <Field id="_252" name="w" type="_100" offset="64" context="_11" access="public" location="f4:148" file="f4" line="148"/>
  <Field id="_253" name="h" type="_100" offset="96" context="_11" access="public" location="f4:149" file="f4" line="149"/>
  <Destructor id="_254" name="vpx_image_rect" artificial="1" throw="" context="_11" access="public" mangled="_ZN14vpx_image_rectD1Ev *INTERNAL* " demangled="vpx_image_rect::~vpx_image_rect()" location="f4:145" file="f4" line="145" endline="145" inline="1">
  </Destructor>
  <OperatorMethod id="_255" name="=" returns="_337" artificial="1" throw="" context="_11" access="public" mangled="_ZN14vpx_image_rectaSERKS_" demangled="vpx_image_rect::operator=(vpx_image_rect const&amp;)" location="f4:145" file="f4" line="145" endline="145" inline="1">
    <Argument type="_338" location="f4:145" file="f4" line="145"/>
  </OperatorMethod>
  <Constructor id="_256" name="vpx_image_rect" artificial="1" throw="" context="_11" access="public" mangled="_ZN14vpx_image_rectC1ERKS_ *INTERNAL* " demangled="vpx_image_rect::vpx_image_rect(vpx_image_rect const&amp;)" location="f4:145" file="f4" line="145" endline="145" inline="1">
    <Argument type="_338" location="f4:145" file="f4" line="145"/>
  </Constructor>
  <Constructor id="_257" name="vpx_image_rect" artificial="1" throw="" context="_11" access="public" mangled="_ZN14vpx_image_rectC1Ev *INTERNAL* " demangled="vpx_image_rect::vpx_image_rect()" location="f4:145" file="f4" line="145" inline="1"/>
  <FundamentalType id="_258" name="complex float" size="64" align="32"/>
  <FundamentalType id="_259" name="complex long double" size="192" align="32"/>
  <FundamentalType id="_260" name="void" align="8"/>
  <PointerType id="_261" type="_73" size="32" align="32"/>
  <FundamentalType id="_262" name="complex double" size="128" align="64"/>
  <Field id="_263" name="id" type="_100" offset="0" context="_42" access="public" location="f1:481" file="f1" line="481"/>
  <Field id="_264" name="sz" type="_339" offset="32" context="_42" access="public" location="f1:482" file="f1" line="482"/>
  <Field id="_265" name="align" type="_100" offset="64" context="_42" access="public" location="f1:483" file="f1" line="483"/>
  <Field id="_266" name="flags" type="_100" offset="96" context="_42" access="public" location="f1:484" file="f1" line="484"/>
  <Field id="_267" name="base" type="_290" offset="128" context="_42" access="public" location="f1:490" file="f1" line="490"/>
  <Field id="_268" name="dtor" type="_340" offset="160" context="_42" access="public" location="f1:491" file="f1" line="491"/>
  <Field id="_269" name="priv" type="_290" offset="192" context="_42" access="public" location="f1:492" file="f1" line="492"/>
  <Destructor id="_270" name="vpx_codec_mmap" artificial="1" throw="" context="_42" access="public" mangled="_ZN14vpx_codec_mmapD1Ev *INTERNAL* " demangled="vpx_codec_mmap::~vpx_codec_mmap()" location="f1:477" file="f1" line="477" endline="477" inline="1">
  </Destructor>
  <OperatorMethod id="_271" name="=" returns="_341" artificial="1" throw="" context="_42" access="public" mangled="_ZN14vpx_codec_mmapaSERKS_" demangled="vpx_codec_mmap::operator=(vpx_codec_mmap const&amp;)" location="f1:477" file="f1" line="477" endline="477" inline="1">
    <Argument type="_342" location="f1:477" file="f1" line="477"/>
  </OperatorMethod>
  <Constructor id="_272" name="vpx_codec_mmap" artificial="1" throw="" context="_42" access="public" mangled="_ZN14vpx_codec_mmapC1ERKS_ *INTERNAL* " demangled="vpx_codec_mmap::vpx_codec_mmap(vpx_codec_mmap const&amp;)" location="f1:477" file="f1" line="477" endline="477" inline="1">
    <Argument type="_342" location="f1:477" file="f1" line="477"/>
  </Constructor>
  <Constructor id="_273" name="vpx_codec_mmap" artificial="1" throw="" context="_42" access="public" mangled="_ZN14vpx_codec_mmapC1Ev *INTERNAL* " demangled="vpx_codec_mmap::vpx_codec_mmap()" location="f1:477" file="f1" line="477" inline="1"/>
  <PointerType id="_274" type="_343" size="32" align="32"/>
  <PointerType id="_275" type="_67" size="32" align="32"/>
  <PointerType id="_276" type="_90" size="32" align="32"/>
  <Field id="_278" name="name" type="_240" offset="0" context="_66" access="public" location="f1:195" file="f1" line="195"/>
  <Field id="_279" name="iface" type="_310" offset="32" context="_66" access="public" location="f1:196" file="f1" line="196"/>
  <Field id="_280" name="err" type="_214" offset="64" context="_66" access="public" location="f1:197" file="f1" line="197"/>
  <Field id="_281" name="err_detail" type="_240" offset="96" context="_66" access="public" location="f1:198" file="f1" line="198"/>
  <Field id="_282" name="init_flags" type="_70" offset="128" context="_66" access="public" location="f1:199" file="f1" line="199"/>
  <Field id="_283" name="config" type="_285" offset="160" context="_66" access="public" location="f1:205" file="f1" line="205"/>
  <Field id="_284" name="priv" type="_344" offset="192" context="_66" access="public" location="f1:206" file="f1" line="206"/>
  <Union id="_285" context="_66" access="public" mangled="N13vpx_codec_ctx3$_2E" demangled="vpx_codec_ctx::$_2" location="f1:201" file="f1" line="201" artificial="1" size="32" align="32" members="_345 _346 _347 _348 _349 _350 _351 " bases=""/>
  <Destructor id="_286" name="vpx_codec_ctx" artificial="1" throw="" context="_66" access="public" mangled="_ZN13vpx_codec_ctxD1Ev *INTERNAL* " demangled="vpx_codec_ctx::~vpx_codec_ctx()" location="f1:194" file="f1" line="194" endline="194" inline="1">
  </Destructor>
  <OperatorMethod id="_287" name="=" returns="_352" artificial="1" throw="" context="_66" access="public" mangled="_ZN13vpx_codec_ctxaSERKS_" demangled="vpx_codec_ctx::operator=(vpx_codec_ctx const&amp;)" location="f1:194" file="f1" line="194" endline="194" inline="1">
    <Argument type="_353" location="f1:194" file="f1" line="194"/>
  </OperatorMethod>
  <Constructor id="_288" name="vpx_codec_ctx" artificial="1" throw="" context="_66" access="public" mangled="_ZN13vpx_codec_ctxC1ERKS_ *INTERNAL* " demangled="vpx_codec_ctx::vpx_codec_ctx(vpx_codec_ctx const&amp;)" location="f1:194" file="f1" line="194" endline="194" inline="1">
    <Argument type="_353" location="f1:194" file="f1" line="194"/>
  </Constructor>
  <Constructor id="_289" name="vpx_codec_ctx" artificial="1" throw="" context="_66" access="public" mangled="_ZN13vpx_codec_ctxC1Ev *INTERNAL* " demangled="vpx_codec_ctx::vpx_codec_ctx()" location="f1:194" file="f1" line="194" inline="1"/>
  <PointerType id="_290" type="_260" size="32" align="32"/>
  <Field id="_291" name="fmt" type="_238" offset="0" context="_72" access="public" location="f4:99" file="f4" line="99"/>
  <Field id="_292" name="w" type="_100" offset="32" context="_72" access="public" location="f4:102" file="f4" line="102"/>
  <Field id="_293" name="h" type="_100" offset="64" context="_72" access="public" location="f4:103" file="f4" line="103"/>
  <Field id="_294" name="d_w" type="_100" offset="96" context="_72" access="public" location="f4:106" file="f4" line="106"/>
  <Field id="_295" name="d_h" type="_100" offset="128" context="_72" access="public" location="f4:107" file="f4" line="107"/>
  <Field id="_296" name="x_chroma_shift" type="_100" offset="160" context="_72" access="public" location="f4:110" file="f4" line="110"/>
  <Field id="_297" name="y_chroma_shift" type="_100" offset="192" context="_72" access="public" location="f4:111" file="f4" line="111"/>
  <Field id="_298" name="planes" type="_354" offset="224" context="_72" access="public" location="f4:126" file="f4" line="126"/>
  <Field id="_299" name="stride" type="_355" offset="352" context="_72" access="public" location="f4:127" file="f4" line="127"/>
  <Field id="_300" name="bps" type="_45" offset="480" context="_72" access="public" location="f4:129" file="f4" line="129"/>
  <Field id="_301" name="user_priv" type="_290" offset="512" context="_72" access="public" location="f4:134" file="f4" line="134"/>
  <Field id="_302" name="img_data" type="_331" offset="544" context="_72" access="public" location="f4:138" file="f4" line="138"/>
  <Field id="_303" name="img_data_owner" type="_45" offset="576" context="_72" access="public" location="f4:139" file="f4" line="139"/>
  <Field id="_304" name="self_allocd" type="_45" offset="608" context="_72" access="public" location="f4:140" file="f4" line="140"/>
  <Destructor id="_305" name="vpx_image" artificial="1" throw="" context="_72" access="public" mangled="_ZN9vpx_imageD1Ev *INTERNAL* " demangled="vpx_image::~vpx_image()" location="f4:98" file="f4" line="98" endline="98" inline="1">
  </Destructor>
  <OperatorMethod id="_306" name="=" returns="_356" artificial="1" throw="" context="_72" access="public" mangled="_ZN9vpx_imageaSERKS_" demangled="vpx_image::operator=(vpx_image const&amp;)" location="f4:98" file="f4" line="98" endline="98" inline="1">
    <Argument type="_357" location="f4:98" file="f4" line="98"/>
  </OperatorMethod>
  <Constructor id="_307" name="vpx_image" artificial="1" throw="" context="_72" access="public" mangled="_ZN9vpx_imageC1ERKS_ *INTERNAL* " demangled="vpx_image::vpx_image(vpx_image const&amp;)" location="f4:98" file="f4" line="98" endline="98" inline="1">
    <Argument type="_357" location="f4:98" file="f4" line="98"/>
  </Constructor>
  <Constructor id="_308" name="vpx_image" artificial="1" throw="" context="_72" access="public" mangled="_ZN9vpx_imageC1Ev *INTERNAL* " demangled="vpx_image::vpx_image()" location="f4:98" file="f4" line="98" inline="1"/>
  <PointerType id="_309" type="_43" size="32" align="32"/>
  <PointerType id="_310" type="_193" size="32" align="32"/>
  <Field id="_311" name="post_proc_flag" type="_45" offset="0" context="_89" access="public" location="f5:81" file="f5" line="81"/>
  <Field id="_312" name="deblocking_level" type="_45" offset="32" context="_89" access="public" location="f5:82" file="f5" line="82"/>
  <Field id="_313" name="noise_level" type="_45" offset="64" context="_89" access="public" location="f5:83" file="f5" line="83"/>
  <Destructor id="_314" name="vp8_postproc_cfg" artificial="1" throw="" context="_89" access="public" mangled="_ZN16vp8_postproc_cfgD1Ev *INTERNAL* " demangled="vp8_postproc_cfg::~vp8_postproc_cfg()" location="f5:80" file="f5" line="80" endline="80" inline="1">
  </Destructor>
  <OperatorMethod id="_315" name="=" returns="_358" artificial="1" throw="" context="_89" access="public" mangled="_ZN16vp8_postproc_cfgaSERKS_" demangled="vp8_postproc_cfg::operator=(vp8_postproc_cfg const&amp;)" location="f5:80" file="f5" line="80" endline="80" inline="1">
    <Argument type="_359" location="f5:80" file="f5" line="80"/>
  </OperatorMethod>
  <Constructor id="_316" name="vp8_postproc_cfg" artificial="1" throw="" context="_89" access="public" mangled="_ZN16vp8_postproc_cfgC1ERKS_ *INTERNAL* " demangled="vp8_postproc_cfg::vp8_postproc_cfg(vp8_postproc_cfg const&amp;)" location="f5:80" file="f5" line="80" endline="80" inline="1">
    <Argument type="_359" location="f5:80" file="f5" line="80"/>
  </Constructor>
  <Constructor id="_317" name="vp8_postproc_cfg" artificial="1" throw="" context="_89" access="public" mangled="_ZN16vp8_postproc_cfgC1Ev *INTERNAL* " demangled="vp8_postproc_cfg::vp8_postproc_cfg()" location="f5:80" file="f5" line="80" inline="1"/>
  <PointerType id="_318" type="_45" size="32" align="32"/>
  <Field id="_319" name="frame_type" type="_171" offset="0" context="_99" access="public" location="f5:104" file="f5" line="104"/>
  <Field id="_320" name="img" type="_73" offset="32" context="_99" access="public" location="f5:105" file="f5" line="105"/>
  <Destructor id="_321" name="vpx_ref_frame" artificial="1" throw="" context="_99" access="public" mangled="_ZN13vpx_ref_frameD1Ev *INTERNAL* " demangled="vpx_ref_frame::~vpx_ref_frame()" location="f5:103" file="f5" line="103" endline="103" inline="1">
  </Destructor>
  <OperatorMethod id="_322" name="=" returns="_360" artificial="1" throw="" context="_99" access="public" mangled="_ZN13vpx_ref_frameaSERKS_" demangled="vpx_ref_frame::operator=(vpx_ref_frame const&amp;)" location="f5:103" file="f5" line="103" endline="103" inline="1">
    <Argument type="_361" location="f5:103" file="f5" line="103"/>
  </OperatorMethod>
  <Constructor id="_323" name="vpx_ref_frame" artificial="1" throw="" context="_99" access="public" mangled="_ZN13vpx_ref_frameC1ERKS_ *INTERNAL* " demangled="vpx_ref_frame::vpx_ref_frame(vpx_ref_frame const&amp;)" location="f5:103" file="f5" line="103" endline="103" inline="1">
    <Argument type="_361" location="f5:103" file="f5" line="103"/>
  </Constructor>
  <Constructor id="_324" name="vpx_ref_frame" artificial="1" throw="" context="_99" access="public" mangled="_ZN13vpx_ref_frameC1Ev *INTERNAL* " demangled="vpx_ref_frame::vpx_ref_frame()" location="f5:103" file="f5" line="103" inline="1"/>
  <PointerType id="_325" type="_241" size="32" align="32"/>
  <PointerType id="_326" type="_242" size="32" align="32"/>
  <PointerType id="_327" type="_173" size="32" align="32"/>
  <PointerType id="_328" type="_362c" size="32" align="32"/>
  <PointerType id="_329" type="_364" size="32" align="32"/>
  <PointerType id="_330" type="_62" size="32" align="32"/>
  <PointerType id="_331" type="_185" size="32" align="32"/>
  <CvQualifiedType id="_126c" type="_126" const="1"/>
  <ReferenceType id="_335" type="_7" size="32" align="32"/>
  <ReferenceType id="_336" type="_7c" size="32" align="32"/>
  <ReferenceType id="_337" type="_11" size="32" align="32"/>
  <ReferenceType id="_338" type="_11c" size="32" align="32"/>
  <FundamentalType id="_339" name="long unsigned int" size="32" align="32"/>
  <PointerType id="_340" type="_367" size="32" align="32"/>
  <ReferenceType id="_341" type="_42" size="32" align="32"/>
  <ReferenceType id="_342" type="_42c" size="32" align="32"/>
  <PointerType id="_344" type="_151" size="32" align="32"/>
  <Field id="_345" name="dec" type="_369" offset="0" context="_285" access="public" location="f1:202" file="f1" line="202"/>
  <Field id="_346" name="enc" type="_370" offset="0" context="_285" access="public" location="f1:203" file="f1" line="203"/>
  <Field id="_347" name="raw" type="_290" offset="0" context="_285" access="public" location="f1:204" file="f1" line="204"/>
  <Destructor id="_348" name="$_2" artificial="1" throw="" context="_285" access="public" mangled="_ZN13vpx_codec_ctx3$_2D1Ev *INTERNAL* " demangled="vpx_codec_ctx::$_2::~$_2()" location="f1:201" file="f1" line="201" endline="201" inline="1">
  </Destructor>
  <OperatorMethod id="_349" name="=" returns="_371" artificial="1" throw="" context="_285" access="public" mangled="_ZN13vpx_codec_ctx3$_2aSERKS0_" demangled="vpx_codec_ctx::$_2::operator=(vpx_codec_ctx::$_2 const&amp;)" location="f1:201" file="f1" line="201" endline="201" inline="1">
    <Argument type="_372" location="f1:201" file="f1" line="201"/>
  </OperatorMethod>
  <Constructor id="_350" name="vpx_codec_ctx" artificial="1" throw="" context="_285" access="public" mangled="_ZN13vpx_codec_ctx3$_2C1ERKS0_ *INTERNAL* " demangled="vpx_codec_ctx::$_2::$_2(vpx_codec_ctx::$_2 const&amp;)" location="f1:201" file="f1" line="201" endline="201" inline="1">
    <Argument type="_372" location="f1:201" file="f1" line="201"/>
  </Constructor>
  <Constructor id="_351" name="vpx_codec_ctx" artificial="1" throw="" context="_285" access="public" mangled="_ZN13vpx_codec_ctx3$_2C1Ev *INTERNAL* " demangled="vpx_codec_ctx::$_2::$_2()" location="f1:201" file="f1" line="201" inline="1"/>
  <ReferenceType id="_352" type="_66" size="32" align="32"/>
  <ReferenceType id="_353" type="_66c" size="32" align="32"/>
  <ArrayType id="_354" min="0" max="3u" type="_331" size="128" align="32"/>
  <ArrayType id="_355" min="0" max="3u" type="_45" size="128" align="32"/>
  <ReferenceType id="_356" type="_72" size="32" align="32"/>
  <ReferenceType id="_357" type="_72c" size="32" align="32"/>
  <ReferenceType id="_358" type="_89" size="32" align="32"/>
  <ReferenceType id="_359" type="_89c" size="32" align="32"/>
  <ReferenceType id="_360" type="_99" size="32" align="32"/>
  <ReferenceType id="_361" type="_99c" size="32" align="32"/>
  <PointerType id="_369" type="_65" size="32" align="32"/>
  <PointerType id="_370" type="_149" size="32" align="32"/>
  <ReferenceType id="_371" type="_285" size="32" align="32"/>
  <ReferenceType id="_372" type="_285c" size="32" align="32"/>
  <CvQualifiedType id="_260c" type="_260" const="1"/>
  <CvQualifiedType id="_72c" type="_72" const="1"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <CvQualifiedType id="_362c" type="_362" const="1"/>
  <CvQualifiedType id="_285c" type="_285" const="1"/>
  <CvQualifiedType id="_66c" type="_66" const="1"/>
  <FunctionType id="_367" returns="_260">
    <Argument type="_378"/>
  </FunctionType>
  <CvQualifiedType id="_42c" type="_42" const="1"/>
  <CvQualifiedType id="_89c" type="_89" const="1"/>
  <CvQualifiedType id="_99c" type="_99" const="1"/>
  <FundamentalType id="_333" name="char" size="8" align="8"/>
  <PointerType id="_343" type="_333" size="32" align="32"/>
  <CvQualifiedType id="_333c" type="_333" const="1"/>
  <FundamentalType id="_362" name="wchar_t" size="16" align="16"/>
  <PointerType id="_364" type="_362" size="32" align="32"/>
  <PointerType id="_378" type="_42" size="32" align="32"/>
  <File id="f0" name="/usr/local/share/gccxml-0.9/GCC/4.5/gccxml_builtins.h"/>
  <File id="f1" name="../vpxmt/include/vpx/vpx_codec.h"/>
  <File id="f2" name="/usr/include/inttypes.h"/>
  <File id="f3" name="/usr/include/stdint.h"/>
  <File id="f4" name="../vpxmt/include/vpx/vpx_image.h"/>
  <File id="f5" name="../vpxmt/include/vpx/vp8.h"/>
  <File id="f6" name="/usr/lib/gcc/i686-pc-cygwin/4.5.3/include/stddef.h"/>
</GCC_XML>
