<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">
  <Namespace id="_1" name="::" members="_3 _4 _5 _6 _8 _10 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _41 _42 _43 _44 _46 _47 _49 _50 _51 _52 _53 _54 _55 _56 _58 _59 _60 _61 _45 _62 _63 _64 _66 _11 _67 _69 _70 _72 _73 _75 _76 _78 _79 _80 _81 _82 _83 _84 _85 _86 _87 _88 _89 _90 _91 _92 _93 _95 _96 _97 _99 _100 _101 _103 _104 _105 _106 _107 _108 _109 _110 _112 _113 _114 _115 _77 _116 _117 _118 _119 _120 _121 _122 _123 _124 _125 _126 _127 _128 _129 _130 _131 _132 _133 _134 _135 _137 _138 _139 _140 _141 _142 _143 _144 _145 _147 _148 _149 _150 _151 _152 _153 _154 _155 _156 _157 _158 _159 _160 _161 _162 _164 _98 _165 _166 _167 _168 _2 _170 _171 _172 _173 _174 _175 _176 _177 _178 _179 _180 _181 _182 _183 _163 _184 _185 _186 _187 _188 _190 _191 _193 _194 _195 _196 _197 _198 _199 _200 _201 _102 _202 _203 _204 _205 _206 _207 _208 _210 _211 _212 _213 _214 _215 _217 _218 _219 _220 _221 _222 _223 _224 _225 _226 _227 _228 _229 _7 _230 _189 _136 _231 _232 _233 _234 _235 _236 _237 _238 _239 _240 _57 _241 _242 _243 _244 _245 _246 _247 _248 _249 _250 _251 _252 _253 _254 _255 _256 _257 _258 _259 _71 _260 _94 _192 _261 _262 _263 _264 _265 _266 _169 _267 _268 _269 _270 _271 _272 " mangled="_Z2::" demangled="::"/>
  <Namespace id="_2" name="std" context="_1" members="" mangled="_Z3std" demangled="std"/>

  <Function id="_248" name="__builtin_ceilf" returns="_275" context="_1" mangled="ceilf" location="f0:37" file="f0" line="37" extern="1" attributes="nothrow const">
    <Argument type="_275" location="f0:37" file="f0" line="37"/>
  </Function>
  <Function id="_249" name="__builtin_ceill" returns="_276" context="_1" mangled="ceill" location="f0:38" file="f0" line="38" extern="1" attributes="nothrow const">
    <Argument type="_276" location="f0:38" file="f0" line="38"/>
  </Function>
  <Function id="_250" name="vpx_codec_control_" returns="_247" context="_1" location="f1:375" file="f1" line="375" extern="1">
    <Argument name="ctx" type="_294" location="f1:375" file="f1" line="375"/>
    <Argument name="ctrl_id" type="_48" location="f1:375" file="f1" line="375"/>
    <Ellipsis/>
  </Function>
  <Function id="_251" name="__builtin_csinf" returns="_292" context="_1" mangled="csinf" location="f0:114" file="f0" line="114" extern="1" attributes="nothrow pure no vops">
    <Argument type="_292" location="f0:114" file="f0" line="114"/>
  </Function>
  <Function id="_252" name="__builtin_csinh" returns="_298" context="_1" mangled="csinh" location="f0:118" file="f0" line="118" extern="1" attributes="nothrow pure no vops">
    <Argument type="_298" location="f0:118" file="f0" line="118"/>
  </Function>
  <Function id="_253" name="__builtin_csinl" returns="_293" context="_1" mangled="csinl" location="f0:116" file="f0" line="116" extern="1" attributes="nothrow pure no vops">
    <Argument type="_293" location="f0:116" file="f0" line="116"/>
  </Function>
  <Function id="_254" name="__builtin_acos" returns="_273" context="_1" mangled="acos" location="f0:24" file="f0" line="24" extern="1" attributes="nothrow">
    <Argument type="_273" location="f0:24" file="f0" line="24"/>
  </Function>
  <Function id="_255" name="__builtin_ctzll" returns="_48" context="_1" location="f0:98" file="f0" line="98" extern="1" attributes="nothrow const">
    <Argument type="_40" location="f0:98" file="f0" line="98"/>
  </Function>
  <Typedef id="_256" name="uint_fast32_t" type="_111" context="_1" location="f3:53" file="f3" line="53"/>
  <Function id="_257" name="vpx_codec_control_VP8E_SET_ACTIVEMAP" returns="_247" static="1" context="_1" location="f5:293" file="f5" line="293" endline="293" attributes="unused">
    <Argument name="ctx" type="_294" location="f5:293" file="f5" line="293"/>
    <Argument name="ctrl_id" type="_48" location="f5:293" file="f5" line="293"/>
    <Argument name="data" type="_392" location="f5:293" file="f5" line="293"/>
  </Function>
  <Function id="_258" name="__builtin_cargf" returns="_275" context="_1" mangled="cargf" location="f0:93" file="f0" line="93" extern="1" attributes="nothrow pure no vops">
    <Argument type="_292" location="f0:93" file="f0" line="93"/>
  </Function>
  <Function id="_259" name="__builtin_cargl" returns="_276" context="_1" mangled="cargl" location="f0:95" file="f0" line="95" extern="1" attributes="nothrow pure no vops">
    <Argument type="_293" location="f0:95" file="f0" line="95"/>
  </Function>
  <Function id="_260" name="imaxabs" returns="_212" context="_1" location="f2:235" file="f2" line="235" extern="1" attributes="nothrow const __cdecl__">
    <Argument type="_212" location="f2:235" file="f2" line="235"/>
  </Function>
  <Function id="_261" name="__builtin_cosf" returns="_275" context="_1" mangled="cosf" location="f0:40" file="f0" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_275" location="f0:40" file="f0" line="40"/>
  </Function>
  <Function id="_262" name="__builtin_cosh" returns="_273" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow">
    <Argument type="_273" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_263" name="__builtin_cosl" returns="_276" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_276" location="f0:44" file="f0" line="44"/>
  </Function>
  <Function id="_264" name="__builtin_isgreater" returns="_283" context="_1" location="f0:137" file="f0" line="137" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Typedef id="_265" name="uint_least8_t" type="_216" context="_1" location="f3:39" file="f3" line="39"/>
  <Function id="_266" name="vpx_codec_iface_name" returns="_274" context="_1" location="f1:277" file="f1" line="277" extern="1">
    <Argument name="iface" type="_345" location="f1:277" file="f1" line="277"/>
  </Function>
  <Function id="_267" name="__builtin_sinf" returns="_275" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_275" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_268" name="__builtin_sinh" returns="_273" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_273" location="f0:77" file="f0" line="77"/>
  </Function>
  <Function id="_269" name="__builtin_sinl" returns="_276" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_276" location="f0:80" file="f0" line="80"/>
  </Function>
  <Typedef id="_270" name="uint64_t" type="_9" context="_1" location="f3:30" file="f3" line="30"/>
  <Function id="_271" name="__builtin_csin" returns="_298" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_298" location="f0:115" file="f0" line="115"/>
  </Function>
  <Typedef id="_272" name="vpx_img_fmt_t" type="_88" context="_1" location="f4:60" file="f4" line="60"/>
  <FundamentalType id="_273" name="double" size="64" align="64"/>
  <PointerType id="_274" type="_393c" size="32" align="32"/>
  <FundamentalType id="_275" name="float" size="32" align="32"/>
  <FundamentalType id="_276" name="long double" size="96" align="32"/>
  <Field id="_277" name="quot" type="_212" offset="0" context="_7" access="public" location="f2:231" file="f2" line="231"/>
  <Field id="_278" name="rem" type="_212" offset="64" context="_7" access="public" location="f2:232" file="f2" line="232"/>
  <Destructor id="_279" name="$_0" artificial="1" throw="" context="_7" access="public" mangled="_ZN9imaxdiv_tD1Ev *INTERNAL* " demangled="imaxdiv_t::~imaxdiv_t()" location="f2:233" file="f2" line="233" endline="233" inline="1">
  </Destructor>
  <OperatorMethod id="_280" name="=" returns="_395" artificial="1" throw="" context="_7" access="public" mangled="_ZN9imaxdiv_taSERKS_" demangled="imaxdiv_t::operator=(imaxdiv_t const&amp;)" location="f2:233" file="f2" line="233" endline="233" inline="1">
    <Argument type="_396" location="f2:230" file="f2" line="230"/>
  </OperatorMethod>
  <Constructor id="_281" name="$_0" artificial="1" throw="" context="_7" access="public" mangled="_ZN9imaxdiv_tC1ERKS_ *INTERNAL* " demangled="imaxdiv_t::imaxdiv_t(imaxdiv_t const&amp;)" location="f2:233" file="f2" line="233" endline="233" inline="1">
    <Argument type="_396" location="f2:230" file="f2" line="230"/>
  </Constructor>
  <Constructor id="_282" name="$_0" artificial="1" throw="" context="_7" access="public" mangled="_ZN9imaxdiv_tC1Ev *INTERNAL* " demangled="imaxdiv_t::imaxdiv_t()" location="f2:233" file="f2" line="233" inline="1"/>
  <FundamentalType id="_283" name="bool" size="8" align="8"/>
  <Field id="_284" name="x" type="_111" offset="0" context="_11" access="public" location="f4:146" file="f4" line="146"/>
  <Field id="_285" name="y" type="_111" offset="32" context="_11" access="public" location="f4:147" file="f4" line="147"/>
  <Field id="_286" name="w" type="_111" offset="64" context="_11" access="public" location="f4:148" file="f4" line="148"/>
  <Field id="_287" name="h" type="_111" offset="96" context="_11" access="public" location="f4:149" file="f4" line="149"/>
  <Destructor id="_288" name="vpx_image_rect" artificial="1" throw="" context="_11" access="public" mangled="_ZN14vpx_image_rectD1Ev *INTERNAL* " demangled="vpx_image_rect::~vpx_image_rect()" location="f4:145" file="f4" line="145" endline="145" inline="1">
  </Destructor>
  <OperatorMethod id="_289" name="=" returns="_397" artificial="1" throw="" context="_11" access="public" mangled="_ZN14vpx_image_rectaSERKS_" demangled="vpx_image_rect::operator=(vpx_image_rect const&amp;)" location="f4:145" file="f4" line="145" endline="145" inline="1">
    <Argument type="_398" location="f4:145" file="f4" line="145"/>
  </OperatorMethod>
  <Constructor id="_290" name="vpx_image_rect" artificial="1" throw="" context="_11" access="public" mangled="_ZN14vpx_image_rectC1ERKS_ *INTERNAL* " demangled="vpx_image_rect::vpx_image_rect(vpx_image_rect const&amp;)" location="f4:145" file="f4" line="145" endline="145" inline="1">
    <Argument type="_398" location="f4:145" file="f4" line="145"/>
  </Constructor>
  <Constructor id="_291" name="vpx_image_rect" artificial="1" throw="" context="_11" access="public" mangled="_ZN14vpx_image_rectC1Ev *INTERNAL* " demangled="vpx_image_rect::vpx_image_rect()" location="f4:145" file="f4" line="145" inline="1"/>
  <FundamentalType id="_292" name="complex float" size="64" align="32"/>
  <FundamentalType id="_293" name="complex long double" size="192" align="32"/>
  <PointerType id="_294" type="_72" size="32" align="32"/>
  <FundamentalType id="_295" name="void" align="8"/>
  <PointerType id="_296" type="_78" size="32" align="32"/>
  <PointerType id="_297" type="_170" size="32" align="32"/>
  <FundamentalType id="_298" name="complex double" size="128" align="64"/>
  <Field id="_299" name="id" type="_111" offset="0" context="_45" access="public" location="f1:481" file="f1" line="481"/>
  <Field id="_300" name="sz" type="_399" offset="32" context="_45" access="public" location="f1:482" file="f1" line="482"/>
  <Field id="_301" name="align" type="_111" offset="64" context="_45" access="public" location="f1:483" file="f1" line="483"/>
  <Field id="_302" name="flags" type="_111" offset="96" context="_45" access="public" location="f1:484" file="f1" line="484"/>
  <Field id="_303" name="base" type="_325" offset="128" context="_45" access="public" location="f1:490" file="f1" line="490"/>
  <Field id="_304" name="dtor" type="_400" offset="160" context="_45" access="public" location="f1:491" file="f1" line="491"/>
  <Field id="_305" name="priv" type="_325" offset="192" context="_45" access="public" location="f1:492" file="f1" line="492"/>
  <Destructor id="_306" name="vpx_codec_mmap" artificial="1" throw="" context="_45" access="public" mangled="_ZN14vpx_codec_mmapD1Ev *INTERNAL* " demangled="vpx_codec_mmap::~vpx_codec_mmap()" location="f1:477" file="f1" line="477" endline="477" inline="1">
  </Destructor>
  <OperatorMethod id="_307" name="=" returns="_401" artificial="1" throw="" context="_45" access="public" mangled="_ZN14vpx_codec_mmapaSERKS_" demangled="vpx_codec_mmap::operator=(vpx_codec_mmap const&amp;)" location="f1:477" file="f1" line="477" endline="477" inline="1">
    <Argument type="_402" location="f1:477" file="f1" line="477"/>
  </OperatorMethod>
  <Constructor id="_308" name="vpx_codec_mmap" artificial="1" throw="" context="_45" access="public" mangled="_ZN14vpx_codec_mmapC1ERKS_ *INTERNAL* " demangled="vpx_codec_mmap::vpx_codec_mmap(vpx_codec_mmap const&amp;)" location="f1:477" file="f1" line="477" endline="477" inline="1">
    <Argument type="_402" location="f1:477" file="f1" line="477"/>
  </Constructor>
  <Constructor id="_309" name="vpx_codec_mmap" artificial="1" throw="" context="_45" access="public" mangled="_ZN14vpx_codec_mmapC1Ev *INTERNAL* " demangled="vpx_codec_mmap::vpx_codec_mmap()" location="f1:477" file="f1" line="477" inline="1"/>
  <PointerType id="_310" type="_403" size="32" align="32"/>
  <PointerType id="_311" type="_95" size="32" align="32"/>
  <Field id="_313" name="name" type="_274" offset="0" context="_71" access="public" location="f1:195" file="f1" line="195"/>
  <Field id="_314" name="iface" type="_345" offset="32" context="_71" access="public" location="f1:196" file="f1" line="196"/>
  <Field id="_315" name="err" type="_247" offset="64" context="_71" access="public" location="f1:197" file="f1" line="197"/>
  <Field id="_316" name="err_detail" type="_274" offset="96" context="_71" access="public" location="f1:198" file="f1" line="198"/>
  <Field id="_317" name="init_flags" type="_75" offset="128" context="_71" access="public" location="f1:199" file="f1" line="199"/>
  <Field id="_318" name="config" type="_320" offset="160" context="_71" access="public" location="f1:205" file="f1" line="205"/>
  <Field id="_319" name="priv" type="_404" offset="192" context="_71" access="public" location="f1:206" file="f1" line="206"/>
  <Union id="_320" context="_71" access="public" mangled="N13vpx_codec_ctx3$_2E" demangled="vpx_codec_ctx::$_2" location="f1:201" file="f1" line="201" artificial="1" size="32" align="32" members="_405 _406 _407 _408 _409 _410 _411 " bases=""/>
  <Destructor id="_321" name="vpx_codec_ctx" artificial="1" throw="" context="_71" access="public" mangled="_ZN13vpx_codec_ctxD1Ev *INTERNAL* " demangled="vpx_codec_ctx::~vpx_codec_ctx()" location="f1:194" file="f1" line="194" endline="194" inline="1">
  </Destructor>
  <OperatorMethod id="_322" name="=" returns="_412" artificial="1" throw="" context="_71" access="public" mangled="_ZN13vpx_codec_ctxaSERKS_" demangled="vpx_codec_ctx::operator=(vpx_codec_ctx const&amp;)" location="f1:194" file="f1" line="194" endline="194" inline="1">
    <Argument type="_413" location="f1:194" file="f1" line="194"/>
  </OperatorMethod>
  <Constructor id="_323" name="vpx_codec_ctx" artificial="1" throw="" context="_71" access="public" mangled="_ZN13vpx_codec_ctxC1ERKS_ *INTERNAL* " demangled="vpx_codec_ctx::vpx_codec_ctx(vpx_codec_ctx const&amp;)" location="f1:194" file="f1" line="194" endline="194" inline="1">
    <Argument type="_413" location="f1:194" file="f1" line="194"/>
  </Constructor>
  <Constructor id="_324" name="vpx_codec_ctx" artificial="1" throw="" context="_71" access="public" mangled="_ZN13vpx_codec_ctxC1Ev *INTERNAL* " demangled="vpx_codec_ctx::vpx_codec_ctx()" location="f1:194" file="f1" line="194" inline="1"/>
  <PointerType id="_325" type="_295" size="32" align="32"/>
  <Field id="_326" name="fmt" type="_272" offset="0" context="_77" access="public" location="f4:99" file="f4" line="99"/>
  <Field id="_327" name="w" type="_111" offset="32" context="_77" access="public" location="f4:102" file="f4" line="102"/>
  <Field id="_328" name="h" type="_111" offset="64" context="_77" access="public" location="f4:103" file="f4" line="103"/>
  <Field id="_329" name="d_w" type="_111" offset="96" context="_77" access="public" location="f4:106" file="f4" line="106"/>
  <Field id="_330" name="d_h" type="_111" offset="128" context="_77" access="public" location="f4:107" file="f4" line="107"/>
  <Field id="_331" name="x_chroma_shift" type="_111" offset="160" context="_77" access="public" location="f4:110" file="f4" line="110"/>
  <Field id="_332" name="y_chroma_shift" type="_111" offset="192" context="_77" access="public" location="f4:111" file="f4" line="111"/>
  <Field id="_333" name="planes" type="_414" offset="224" context="_77" access="public" location="f4:126" file="f4" line="126"/>
  <Field id="_334" name="stride" type="_415" offset="352" context="_77" access="public" location="f4:127" file="f4" line="127"/>
  <Field id="_335" name="bps" type="_48" offset="480" context="_77" access="public" location="f4:129" file="f4" line="129"/>
  <Field id="_336" name="user_priv" type="_325" offset="512" context="_77" access="public" location="f4:134" file="f4" line="134"/>
  <Field id="_337" name="img_data" type="_390" offset="544" context="_77" access="public" location="f4:138" file="f4" line="138"/>
  <Field id="_338" name="img_data_owner" type="_48" offset="576" context="_77" access="public" location="f4:139" file="f4" line="139"/>
  <Field id="_339" name="self_allocd" type="_48" offset="608" context="_77" access="public" location="f4:140" file="f4" line="140"/>
  <Destructor id="_340" name="vpx_image" artificial="1" throw="" context="_77" access="public" mangled="_ZN9vpx_imageD1Ev *INTERNAL* " demangled="vpx_image::~vpx_image()" location="f4:98" file="f4" line="98" endline="98" inline="1">
  </Destructor>
  <OperatorMethod id="_341" name="=" returns="_416" artificial="1" throw="" context="_77" access="public" mangled="_ZN9vpx_imageaSERKS_" demangled="vpx_image::operator=(vpx_image const&amp;)" location="f4:98" file="f4" line="98" endline="98" inline="1">
    <Argument type="_417" location="f4:98" file="f4" line="98"/>
  </OperatorMethod>
  <Constructor id="_342" name="vpx_image" artificial="1" throw="" context="_77" access="public" mangled="_ZN9vpx_imageC1ERKS_ *INTERNAL* " demangled="vpx_image::vpx_image(vpx_image const&amp;)" location="f4:98" file="f4" line="98" endline="98" inline="1">
    <Argument type="_417" location="f4:98" file="f4" line="98"/>
  </Constructor>
  <Constructor id="_343" name="vpx_image" artificial="1" throw="" context="_77" access="public" mangled="_ZN9vpx_imageC1Ev *INTERNAL* " demangled="vpx_image::vpx_image()" location="f4:98" file="f4" line="98" inline="1"/>
  <PointerType id="_344" type="_46" size="32" align="32"/>
  <PointerType id="_345" type="_224" size="32" align="32"/>
  <Field id="_346" name="post_proc_flag" type="_48" offset="0" context="_94" access="public" location="f6:81" file="f6" line="81"/>
  <Field id="_347" name="deblocking_level" type="_48" offset="32" context="_94" access="public" location="f6:82" file="f6" line="82"/>
  <Field id="_348" name="noise_level" type="_48" offset="64" context="_94" access="public" location="f6:83" file="f6" line="83"/>
  <Destructor id="_349" name="vp8_postproc_cfg" artificial="1" throw="" context="_94" access="public" mangled="_ZN16vp8_postproc_cfgD1Ev *INTERNAL* " demangled="vp8_postproc_cfg::~vp8_postproc_cfg()" location="f6:80" file="f6" line="80" endline="80" inline="1">
  </Destructor>
  <OperatorMethod id="_350" name="=" returns="_418" artificial="1" throw="" context="_94" access="public" mangled="_ZN16vp8_postproc_cfgaSERKS_" demangled="vp8_postproc_cfg::operator=(vp8_postproc_cfg const&amp;)" location="f6:80" file="f6" line="80" endline="80" inline="1">
    <Argument type="_419" location="f6:80" file="f6" line="80"/>
  </OperatorMethod>
  <Constructor id="_351" name="vp8_postproc_cfg" artificial="1" throw="" context="_94" access="public" mangled="_ZN16vp8_postproc_cfgC1ERKS_ *INTERNAL* " demangled="vp8_postproc_cfg::vp8_postproc_cfg(vp8_postproc_cfg const&amp;)" location="f6:80" file="f6" line="80" endline="80" inline="1">
    <Argument type="_419" location="f6:80" file="f6" line="80"/>
  </Constructor>
  <Constructor id="_352" name="vp8_postproc_cfg" artificial="1" throw="" context="_94" access="public" mangled="_ZN16vp8_postproc_cfgC1Ev *INTERNAL* " demangled="vp8_postproc_cfg::vp8_postproc_cfg()" location="f6:80" file="f6" line="80" inline="1"/>
  <Field id="_353" name="roi_map" type="_390" offset="0" context="_102" access="public" location="f5:204" file="f5" line="204"/>
  <Field id="_354" name="rows" type="_111" offset="32" context="_102" access="public" location="f5:205" file="f5" line="205"/>
  <Field id="_355" name="cols" type="_111" offset="64" context="_102" access="public" location="f5:206" file="f5" line="206"/>
  <Field id="_356" name="delta_q" type="_415" offset="96" context="_102" access="public" location="f5:207" file="f5" line="207"/>
  <Field id="_357" name="delta_lf" type="_415" offset="224" context="_102" access="public" location="f5:208" file="f5" line="208"/>
  <Field id="_358" name="static_threshold" type="_420" offset="352" context="_102" access="public" location="f5:209" file="f5" line="209"/>
  <Destructor id="_359" name="vpx_roi_map" artificial="1" throw="" context="_102" access="public" mangled="_ZN11vpx_roi_mapD1Ev *INTERNAL* " demangled="vpx_roi_map::~vpx_roi_map()" location="f5:203" file="f5" line="203" endline="203" inline="1">
  </Destructor>
  <OperatorMethod id="_360" name="=" returns="_421" artificial="1" throw="" context="_102" access="public" mangled="_ZN11vpx_roi_mapaSERKS_" demangled="vpx_roi_map::operator=(vpx_roi_map const&amp;)" location="f5:203" file="f5" line="203" endline="203" inline="1">
    <Argument type="_422" location="f5:203" file="f5" line="203"/>
  </OperatorMethod>
  <Constructor id="_361" name="vpx_roi_map" artificial="1" throw="" context="_102" access="public" mangled="_ZN11vpx_roi_mapC1ERKS_ *INTERNAL* " demangled="vpx_roi_map::vpx_roi_map(vpx_roi_map const&amp;)" location="f5:203" file="f5" line="203" endline="203" inline="1">
    <Argument type="_422" location="f5:203" file="f5" line="203"/>
  </Constructor>
  <Constructor id="_362" name="vpx_roi_map" artificial="1" throw="" context="_102" access="public" mangled="_ZN11vpx_roi_mapC1Ev *INTERNAL* " demangled="vpx_roi_map::vpx_roi_map()" location="f5:203" file="f5" line="203" inline="1"/>
  <PointerType id="_363" type="_48" size="32" align="32"/>
  <Field id="_364" name="frame_type" type="_198" offset="0" context="_110" access="public" location="f6:104" file="f6" line="104"/>
  <Field id="_365" name="img" type="_78" offset="32" context="_110" access="public" location="f6:105" file="f6" line="105"/>
  <Destructor id="_366" name="vpx_ref_frame" artificial="1" throw="" context="_110" access="public" mangled="_ZN13vpx_ref_frameD1Ev *INTERNAL* " demangled="vpx_ref_frame::~vpx_ref_frame()" location="f6:103" file="f6" line="103" endline="103" inline="1">
  </Destructor>
  <OperatorMethod id="_367" name="=" returns="_423" artificial="1" throw="" context="_110" access="public" mangled="_ZN13vpx_ref_frameaSERKS_" demangled="vpx_ref_frame::operator=(vpx_ref_frame const&amp;)" location="f6:103" file="f6" line="103" endline="103" inline="1">
    <Argument type="_424" location="f6:103" file="f6" line="103"/>
  </OperatorMethod>
  <Constructor id="_368" name="vpx_ref_frame" artificial="1" throw="" context="_110" access="public" mangled="_ZN13vpx_ref_frameC1ERKS_ *INTERNAL* " demangled="vpx_ref_frame::vpx_ref_frame(vpx_ref_frame const&amp;)" location="f6:103" file="f6" line="103" endline="103" inline="1">
    <Argument type="_424" location="f6:103" file="f6" line="103"/>
  </Constructor>
  <Constructor id="_369" name="vpx_ref_frame" artificial="1" throw="" context="_110" access="public" mangled="_ZN13vpx_ref_frameC1Ev *INTERNAL* " demangled="vpx_ref_frame::vpx_ref_frame()" location="f6:103" file="f6" line="103" inline="1"/>
  <PointerType id="_370" type="_275" size="32" align="32"/>
  <PointerType id="_371" type="_276" size="32" align="32"/>
  <PointerType id="_372" type="_201" size="32" align="32"/>
  <PointerType id="_373" type="_425c" size="32" align="32"/>
  <PointerType id="_374" type="_427" size="32" align="32"/>
  <PointerType id="_375" type="_66" size="32" align="32"/>
  <Field id="_376" name="h_scaling_mode" type="_99" offset="0" context="_169" access="public" location="f5:233" file="f5" line="233"/>
  <Field id="_377" name="v_scaling_mode" type="_99" offset="32" context="_169" access="public" location="f5:234" file="f5" line="234"/>
  <Destructor id="_378" name="vpx_scaling_mode" artificial="1" throw="" context="_169" access="public" mangled="_ZN16vpx_scaling_modeD1Ev *INTERNAL* " demangled="vpx_scaling_mode::~vpx_scaling_mode()" location="f5:232" file="f5" line="232" endline="232" inline="1">
  </Destructor>
  <OperatorMethod id="_379" name="=" returns="_428" artificial="1" throw="" context="_169" access="public" mangled="_ZN16vpx_scaling_modeaSERKS_" demangled="vpx_scaling_mode::operator=(vpx_scaling_mode const&amp;)" location="f5:232" file="f5" line="232" endline="232" inline="1">
    <Argument type="_429" location="f5:232" file="f5" line="232"/>
  </OperatorMethod>
  <Constructor id="_380" name="vpx_scaling_mode" artificial="1" throw="" context="_169" access="public" mangled="_ZN16vpx_scaling_modeC1ERKS_ *INTERNAL* " demangled="vpx_scaling_mode::vpx_scaling_mode(vpx_scaling_mode const&amp;)" location="f5:232" file="f5" line="232" endline="232" inline="1">
    <Argument type="_429" location="f5:232" file="f5" line="232"/>
  </Constructor>
  <Constructor id="_381" name="vpx_scaling_mode" artificial="1" throw="" context="_169" access="public" mangled="_ZN16vpx_scaling_modeC1Ev *INTERNAL* " demangled="vpx_scaling_mode::vpx_scaling_mode()" location="f5:232" file="f5" line="232" inline="1"/>
  <PointerType id="_382" type="_103" size="32" align="32"/>
  <Field id="_383" name="active_map" type="_390" offset="0" context="_192" access="public" location="f5:221" file="f5" line="221"/>
  <Field id="_384" name="rows" type="_111" offset="32" context="_192" access="public" location="f5:222" file="f5" line="222"/>
  <Field id="_385" name="cols" type="_111" offset="64" context="_192" access="public" location="f5:223" file="f5" line="223"/>
  <Destructor id="_386" name="vpx_active_map" artificial="1" throw="" context="_192" access="public" mangled="_ZN14vpx_active_mapD1Ev *INTERNAL* " demangled="vpx_active_map::~vpx_active_map()" location="f5:220" file="f5" line="220" endline="220" inline="1">
  </Destructor>
  <OperatorMethod id="_387" name="=" returns="_430" artificial="1" throw="" context="_192" access="public" mangled="_ZN14vpx_active_mapaSERKS_" demangled="vpx_active_map::operator=(vpx_active_map const&amp;)" location="f5:220" file="f5" line="220" endline="220" inline="1">
    <Argument type="_431" location="f5:220" file="f5" line="220"/>
  </OperatorMethod>
  <Constructor id="_388" name="vpx_active_map" artificial="1" throw="" context="_192" access="public" mangled="_ZN14vpx_active_mapC1ERKS_ *INTERNAL* " demangled="vpx_active_map::vpx_active_map(vpx_active_map const&amp;)" location="f5:220" file="f5" line="220" endline="220" inline="1">
    <Argument type="_431" location="f5:220" file="f5" line="220"/>
  </Constructor>
  <Constructor id="_389" name="vpx_active_map" artificial="1" throw="" context="_192" access="public" mangled="_ZN14vpx_active_mapC1Ev *INTERNAL* " demangled="vpx_active_map::vpx_active_map()" location="f5:220" file="f5" line="220" inline="1"/>
  <PointerType id="_390" type="_216" size="32" align="32"/>
  <CvQualifiedType id="_138c" type="_138" const="1"/>
  <PointerType id="_392" type="_193" size="32" align="32"/>
  <ReferenceType id="_395" type="_7" size="32" align="32"/>
  <ReferenceType id="_396" type="_7c" size="32" align="32"/>
  <ReferenceType id="_397" type="_11" size="32" align="32"/>
  <ReferenceType id="_398" type="_11c" size="32" align="32"/>
  <FundamentalType id="_399" name="long unsigned int" size="32" align="32"/>
  <PointerType id="_400" type="_434" size="32" align="32"/>
  <ReferenceType id="_401" type="_45" size="32" align="32"/>
  <ReferenceType id="_402" type="_45c" size="32" align="32"/>
  <PointerType id="_404" type="_164" size="32" align="32"/>
  <Field id="_405" name="dec" type="_436" offset="0" context="_320" access="public" location="f1:202" file="f1" line="202"/>
  <Field id="_406" name="enc" type="_437" offset="0" context="_320" access="public" location="f1:203" file="f1" line="203"/>
  <Field id="_407" name="raw" type="_325" offset="0" context="_320" access="public" location="f1:204" file="f1" line="204"/>
  <Destructor id="_408" name="$_2" artificial="1" throw="" context="_320" access="public" mangled="_ZN13vpx_codec_ctx3$_2D1Ev *INTERNAL* " demangled="vpx_codec_ctx::$_2::~$_2()" location="f1:201" file="f1" line="201" endline="201" inline="1">
  </Destructor>
  <OperatorMethod id="_409" name="=" returns="_438" artificial="1" throw="" context="_320" access="public" mangled="_ZN13vpx_codec_ctx3$_2aSERKS0_" demangled="vpx_codec_ctx::$_2::operator=(vpx_codec_ctx::$_2 const&amp;)" location="f1:201" file="f1" line="201" endline="201" inline="1">
    <Argument type="_439" location="f1:201" file="f1" line="201"/>
  </OperatorMethod>
  <Constructor id="_410" name="vpx_codec_ctx" artificial="1" throw="" context="_320" access="public" mangled="_ZN13vpx_codec_ctx3$_2C1ERKS0_ *INTERNAL* " demangled="vpx_codec_ctx::$_2::$_2(vpx_codec_ctx::$_2 const&amp;)" location="f1:201" file="f1" line="201" endline="201" inline="1">
    <Argument type="_439" location="f1:201" file="f1" line="201"/>
  </Constructor>
  <Constructor id="_411" name="vpx_codec_ctx" artificial="1" throw="" context="_320" access="public" mangled="_ZN13vpx_codec_ctx3$_2C1Ev *INTERNAL* " demangled="vpx_codec_ctx::$_2::$_2()" location="f1:201" file="f1" line="201" inline="1"/>
  <ReferenceType id="_412" type="_71" size="32" align="32"/>
  <ReferenceType id="_413" type="_71c" size="32" align="32"/>
  <ArrayType id="_414" min="0" max="3u" type="_390" size="128" align="32"/>
  <ArrayType id="_415" min="0" max="3u" type="_48" size="128" align="32"/>
  <ReferenceType id="_416" type="_77" size="32" align="32"/>
  <ReferenceType id="_417" type="_77c" size="32" align="32"/>
  <ReferenceType id="_418" type="_94" size="32" align="32"/>
  <ReferenceType id="_419" type="_94c" size="32" align="32"/>
  <ArrayType id="_420" min="0" max="3u" type="_111" size="128" align="32"/>
  <ReferenceType id="_421" type="_102" size="32" align="32"/>
  <ReferenceType id="_422" type="_102c" size="32" align="32"/>
  <ReferenceType id="_423" type="_110" size="32" align="32"/>
  <ReferenceType id="_424" type="_110c" size="32" align="32"/>
  <ReferenceType id="_428" type="_169" size="32" align="32"/>
  <ReferenceType id="_429" type="_169c" size="32" align="32"/>
  <ReferenceType id="_430" type="_192" size="32" align="32"/>
  <ReferenceType id="_431" type="_192c" size="32" align="32"/>
  <PointerType id="_436" type="_70" size="32" align="32"/>
  <PointerType id="_437" type="_162" size="32" align="32"/>
  <ReferenceType id="_438" type="_320" size="32" align="32"/>
  <ReferenceType id="_439" type="_320c" size="32" align="32"/>
  <CvQualifiedType id="_295c" type="_295" const="1"/>
  <CvQualifiedType id="_77c" type="_77" const="1"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <CvQualifiedType id="_425c" type="_425" const="1"/>
  <CvQualifiedType id="_320c" type="_320" const="1"/>
  <CvQualifiedType id="_71c" type="_71" const="1"/>
  <FunctionType id="_434" returns="_295">
    <Argument type="_448"/>
  </FunctionType>
  <CvQualifiedType id="_45c" type="_45" const="1"/>
  <CvQualifiedType id="_94c" type="_94" const="1"/>
  <CvQualifiedType id="_110c" type="_110" const="1"/>
  <CvQualifiedType id="_102c" type="_102" const="1"/>
  <CvQualifiedType id="_192c" type="_192" const="1"/>
  <CvQualifiedType id="_169c" type="_169" const="1"/>
  <FundamentalType id="_393" name="char" size="8" align="8"/>
  <PointerType id="_403" type="_393" size="32" align="32"/>
  <CvQualifiedType id="_393c" type="_393" const="1"/>
  <FundamentalType id="_425" name="wchar_t" size="16" align="16"/>
  <PointerType id="_427" type="_425" size="32" align="32"/>
  <PointerType id="_448" type="_45" size="32" align="32"/>
  <File id="f0" name="/usr/local/share/gccxml-0.9/GCC/4.5/gccxml_builtins.h"/>
  <File id="f1" name="../vpxmt/include/vpx/vpx_codec.h"/>
