<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">
  <Namespace id="_1" name="::" members="_3 _4 _5 _6 _8 _10 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _38 _39 _40 _41 _43 _44 _46 _47 _48 _49 _50 _51 _52 _53 _54 _55 _56 _57 _58 _42 _59 _60 _61 _63 _11 _65 _66 _68 _69 _71 _72 _74 _75 _76 _77 _78 _79 _80 _81 _82 _83 _84 _85 _86 _87 _88 _89 _91 _92 _93 _94 _95 _96 _97 _98 _99 _100 _102 _103 _104 _105 _73 _106 _107 _108 _109 _110 _111 _112 _113 _114 _115 _116 _117 _118 _119 _120 _121 _122 _123 _124 _125 _126 _127 _128 _129 _130 _131 _132 _133 _134 _136 _137 _138 _139 _140 _141 _142 _143 _144 _145 _146 _147 _148 _149 _150 _151 _153 _154 _155 _2 _156 _157 _158 _159 _160 _161 _162 _163 _164 _152 _165 _166 _167 _168 _169 _170 _171 _172 _173 _174 _175 _176 _177 _178 _179 _180 _181 _182 _183 _185 _186 _187 _189 _190 _191 _192 _193 _194 _195 _196 _197 _198 _199 _200 _201 _7 _202 _203 _204 _205 _206 _207 _208 _209 _210 _211 _212 _213 _214 _215 _216 _217 _218 _219 _220 _221 _222 _223 _224 _225 _226 _227 _228 _229 _230 _67 _231 _90 _232 _233 _234 _235 _236 _237 _238 _239 _240 _241 _242 _243 _244 " mangled="_Z2::" demangled="::"/>
  <Namespace id="_2" name="std" context="_1" members="" mangled="_Z3std" demangled="std"/>
  <Function id="_3" name="__builtin_nans" returns="_245" context="_1" location="f0:21" file="f0" line="21" extern="1" attributes="nothrow const nonnull">

  <Function id="_220" name="__builtin_ceilf" returns="_247" context="_1" mangled="ceilf" location="f0:37" file="f0" line="37" extern="1" attributes="nothrow const">
    <Argument type="_247" location="f0:37" file="f0" line="37"/>
  </Function>
  <Function id="_221" name="__builtin_ceill" returns="_248" context="_1" mangled="ceill" location="f0:38" file="f0" line="38" extern="1" attributes="nothrow const">
    <Argument type="_248" location="f0:38" file="f0" line="38"/>
  </Function>
  <Function id="_222" name="vpx_codec_control_" returns="_219" context="_1" location="f1:375" file="f1" line="375" extern="1">
    <Argument name="ctx" type="_280" location="f1:375" file="f1" line="375"/>
    <Argument name="ctrl_id" type="_45" location="f1:375" file="f1" line="375"/>
    <Ellipsis/>
  </Function>
  <Function id="_223" name="__builtin_csinf" returns="_264" context="_1" mangled="csinf" location="f0:114" file="f0" line="114" extern="1" attributes="nothrow pure no vops">
    <Argument type="_264" location="f0:114" file="f0" line="114"/>
  </Function>
  <Function id="_224" name="__builtin_csinh" returns="_268" context="_1" mangled="csinh" location="f0:118" file="f0" line="118" extern="1" attributes="nothrow pure no vops">
    <Argument type="_268" location="f0:118" file="f0" line="118"/>
  </Function>
  <Function id="_225" name="__builtin_csinl" returns="_265" context="_1" mangled="csinl" location="f0:116" file="f0" line="116" extern="1" attributes="nothrow pure no vops">
    <Argument type="_265" location="f0:116" file="f0" line="116"/>
  </Function>
  <Function id="_226" name="__builtin_acos" returns="_245" context="_1" mangled="acos" location="f0:24" file="f0" line="24" extern="1" attributes="nothrow">
    <Argument type="_245" location="f0:24" file="f0" line="24"/>
  </Function>
  <Function id="_227" name="__builtin_ctzll" returns="_45" context="_1" location="f0:98" file="f0" line="98" extern="1" attributes="nothrow const">
    <Argument type="_37" location="f0:98" file="f0" line="98"/>
  </Function>
  <Typedef id="_228" name="uint_fast32_t" type="_101" context="_1" location="f3:53" file="f3" line="53"/>
  <Function id="_229" name="__builtin_cargf" returns="_247" context="_1" mangled="cargf" location="f0:93" file="f0" line="93" extern="1" attributes="nothrow pure no vops">
    <Argument type="_264" location="f0:93" file="f0" line="93"/>
  </Function>
  <Function id="_230" name="__builtin_cargl" returns="_248" context="_1" mangled="cargl" location="f0:95" file="f0" line="95" extern="1" attributes="nothrow pure no vops">
    <Argument type="_265" location="f0:95" file="f0" line="95"/>
  </Function>
  <Function id="_231" name="imaxabs" returns="_186" context="_1" location="f2:235" file="f2" line="235" extern="1" attributes="nothrow const __cdecl__">
    <Argument type="_186" location="f2:235" file="f2" line="235"/>
  </Function>
  <Function id="_232" name="__builtin_cosf" returns="_247" context="_1" mangled="cosf" location="f0:40" file="f0" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_247" location="f0:40" file="f0" line="40"/>
  </Function>
  <Function id="_233" name="__builtin_cosh" returns="_245" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow">
    <Argument type="_245" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_234" name="__builtin_cosl" returns="_248" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_248" location="f0:44" file="f0" line="44"/>
  </Function>
  <Function id="_235" name="vpx_codec_control_VP8D_GET_LAST_REF_UPDATES" returns="_219" static="1" context="_1" location="f5:75" file="f5" line="75" endline="75" attributes="unused">
    <Argument name="ctx" type="_280" location="f5:75" file="f5" line="75"/>
    <Argument name="ctrl_id" type="_45" location="f5:75" file="f5" line="75"/>
    <Argument name="data" type="_281" location="f5:75" file="f5" line="75"/>
  </Function>
  <Function id="_236" name="__builtin_isgreater" returns="_255" context="_1" location="f0:137" file="f0" line="137" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Typedef id="_237" name="uint_least8_t" type="_188" context="_1" location="f3:39" file="f3" line="39"/>
  <Function id="_238" name="vpx_codec_iface_name" returns="_246" context="_1" location="f1:277" file="f1" line="277" extern="1">
    <Argument name="iface" type="_317" location="f1:277" file="f1" line="277"/>
  </Function>
  <Function id="_239" name="__builtin_sinf" returns="_247" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_247" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_240" name="__builtin_sinh" returns="_245" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_245" location="f0:77" file="f0" line="77"/>
  </Function>
  <Function id="_241" name="__builtin_sinl" returns="_248" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_248" location="f0:80" file="f0" line="80"/>
  </Function>
  <Typedef id="_242" name="uint64_t" type="_9" context="_1" location="f3:30" file="f3" line="30"/>
  <Function id="_243" name="__builtin_csin" returns="_268" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_268" location="f0:115" file="f0" line="115"/>
  </Function>
  <Typedef id="_244" name="vpx_img_fmt_t" type="_84" context="_1" location="f4:60" file="f4" line="60"/>
  <FundamentalType id="_245" name="double" size="64" align="64"/>
  <PointerType id="_246" type="_339c" size="32" align="32"/>
  <FundamentalType id="_247" name="float" size="32" align="32"/>
  <FundamentalType id="_248" name="long double" size="96" align="32"/>
  <Field id="_249" name="quot" type="_186" offset="0" context="_7" access="public" location="f2:231" file="f2" line="231"/>
  <Field id="_250" name="rem" type="_186" offset="64" context="_7" access="public" location="f2:232" file="f2" line="232"/>
  <Destructor id="_251" name="$_0" artificial="1" throw="" context="_7" access="public" mangled="_ZN9imaxdiv_tD1Ev *INTERNAL* " demangled="imaxdiv_t::~imaxdiv_t()" location="f2:233" file="f2" line="233" endline="233" inline="1">
  </Destructor>
  <OperatorMethod id="_252" name="=" returns="_341" artificial="1" throw="" context="_7" access="public" mangled="_ZN9imaxdiv_taSERKS_" demangled="imaxdiv_t::operator=(imaxdiv_t const&amp;)" location="f2:233" file="f2" line="233" endline="233" inline="1">
    <Argument type="_342" location="f2:230" file="f2" line="230"/>
  </OperatorMethod>
  <Constructor id="_253" name="$_0" artificial="1" throw="" context="_7" access="public" mangled="_ZN9imaxdiv_tC1ERKS_ *INTERNAL* " demangled="imaxdiv_t::imaxdiv_t(imaxdiv_t const&amp;)" location="f2:233" file="f2" line="233" endline="233" inline="1">
    <Argument type="_342" location="f2:230" file="f2" line="230"/>
  </Constructor>
  <Constructor id="_254" name="$_0" artificial="1" throw="" context="_7" access="public" mangled="_ZN9imaxdiv_tC1Ev *INTERNAL* " demangled="imaxdiv_t::imaxdiv_t()" location="f2:233" file="f2" line="233" inline="1"/>
  <FundamentalType id="_255" name="bool" size="8" align="8"/>
  <Field id="_256" name="x" type="_101" offset="0" context="_11" access="public" location="f4:146" file="f4" line="146"/>
  <Field id="_257" name="y" type="_101" offset="32" context="_11" access="public" location="f4:147" file="f4" line="147"/>
  <Field id="_258" name="w" type="_101" offset="64" context="_11" access="public" location="f4:148" file="f4" line="148"/>
  <Field id="_259" name="h" type="_101" offset="96" context="_11" access="public" location="f4:149" file="f4" line="149"/>
  <Destructor id="_260" name="vpx_image_rect" artificial="1" throw="" context="_11" access="public" mangled="_ZN14vpx_image_rectD1Ev *INTERNAL* " demangled="vpx_image_rect::~vpx_image_rect()" location="f4:145" file="f4" line="145" endline="145" inline="1">
  </Destructor>
  <OperatorMethod id="_261" name="=" returns="_343" artificial="1" throw="" context="_11" access="public" mangled="_ZN14vpx_image_rectaSERKS_" demangled="vpx_image_rect::operator=(vpx_image_rect const&amp;)" location="f4:145" file="f4" line="145" endline="145" inline="1">
    <Argument type="_344" location="f4:145" file="f4" line="145"/>
  </OperatorMethod>
  <Constructor id="_262" name="vpx_image_rect" artificial="1" throw="" context="_11" access="public" mangled="_ZN14vpx_image_rectC1ERKS_ *INTERNAL* " demangled="vpx_image_rect::vpx_image_rect(vpx_image_rect const&amp;)" location="f4:145" file="f4" line="145" endline="145" inline="1">
    <Argument type="_344" location="f4:145" file="f4" line="145"/>
  </Constructor>
  <Constructor id="_263" name="vpx_image_rect" artificial="1" throw="" context="_11" access="public" mangled="_ZN14vpx_image_rectC1Ev *INTERNAL* " demangled="vpx_image_rect::vpx_image_rect()" location="f4:145" file="f4" line="145" inline="1"/>
  <FundamentalType id="_264" name="complex float" size="64" align="32"/>
  <FundamentalType id="_265" name="complex long double" size="192" align="32"/>
  <FundamentalType id="_266" name="void" align="8"/>
  <PointerType id="_267" type="_74" size="32" align="32"/>
  <FundamentalType id="_268" name="complex double" size="128" align="64"/>
  <Field id="_269" name="id" type="_101" offset="0" context="_42" access="public" location="f1:481" file="f1" line="481"/>
  <Field id="_270" name="sz" type="_345" offset="32" context="_42" access="public" location="f1:482" file="f1" line="482"/>
  <Field id="_271" name="align" type="_101" offset="64" context="_42" access="public" location="f1:483" file="f1" line="483"/>
  <Field id="_272" name="flags" type="_101" offset="96" context="_42" access="public" location="f1:484" file="f1" line="484"/>
  <Field id="_273" name="base" type="_297" offset="128" context="_42" access="public" location="f1:490" file="f1" line="490"/>
  <Field id="_274" name="dtor" type="_346" offset="160" context="_42" access="public" location="f1:491" file="f1" line="491"/>
  <Field id="_275" name="priv" type="_297" offset="192" context="_42" access="public" location="f1:492" file="f1" line="492"/>
  <Destructor id="_276" name="vpx_codec_mmap" artificial="1" throw="" context="_42" access="public" mangled="_ZN14vpx_codec_mmapD1Ev *INTERNAL* " demangled="vpx_codec_mmap::~vpx_codec_mmap()" location="f1:477" file="f1" line="477" endline="477" inline="1">
  </Destructor>
  <OperatorMethod id="_277" name="=" returns="_347" artificial="1" throw="" context="_42" access="public" mangled="_ZN14vpx_codec_mmapaSERKS_" demangled="vpx_codec_mmap::operator=(vpx_codec_mmap const&amp;)" location="f1:477" file="f1" line="477" endline="477" inline="1">
    <Argument type="_348" location="f1:477" file="f1" line="477"/>
  </OperatorMethod>
  <Constructor id="_278" name="vpx_codec_mmap" artificial="1" throw="" context="_42" access="public" mangled="_ZN14vpx_codec_mmapC1ERKS_ *INTERNAL* " demangled="vpx_codec_mmap::vpx_codec_mmap(vpx_codec_mmap const&amp;)" location="f1:477" file="f1" line="477" endline="477" inline="1">
    <Argument type="_348" location="f1:477" file="f1" line="477"/>
  </Constructor>
  <Constructor id="_279" name="vpx_codec_mmap" artificial="1" throw="" context="_42" access="public" mangled="_ZN14vpx_codec_mmapC1Ev *INTERNAL* " demangled="vpx_codec_mmap::vpx_codec_mmap()" location="f1:477" file="f1" line="477" inline="1"/>
  <PointerType id="_280" type="_68" size="32" align="32"/>
  <PointerType id="_281" type="_45" size="32" align="32"/>
  <PointerType id="_282" type="_349" size="32" align="32"/>
  <PointerType id="_283" type="_91" size="32" align="32"/>
  <Field id="_285" name="name" type="_246" offset="0" context="_67" access="public" location="f1:195" file="f1" line="195"/>
  <Field id="_286" name="iface" type="_317" offset="32" context="_67" access="public" location="f1:196" file="f1" line="196"/>
  <Field id="_287" name="err" type="_219" offset="64" context="_67" access="public" location="f1:197" file="f1" line="197"/>
  <Field id="_288" name="err_detail" type="_246" offset="96" context="_67" access="public" location="f1:198" file="f1" line="198"/>
  <Field id="_289" name="init_flags" type="_71" offset="128" context="_67" access="public" location="f1:199" file="f1" line="199"/>
  <Field id="_290" name="config" type="_292" offset="160" context="_67" access="public" location="f1:205" file="f1" line="205"/>
  <Field id="_291" name="priv" type="_350" offset="192" context="_67" access="public" location="f1:206" file="f1" line="206"/>
  <Union id="_292" context="_67" access="public" mangled="N13vpx_codec_ctx3$_2E" demangled="vpx_codec_ctx::$_2" location="f1:201" file="f1" line="201" artificial="1" size="32" align="32" members="_351 _352 _353 _354 _355 _356 _357 " bases=""/>
  <Destructor id="_293" name="vpx_codec_ctx" artificial="1" throw="" context="_67" access="public" mangled="_ZN13vpx_codec_ctxD1Ev *INTERNAL* " demangled="vpx_codec_ctx::~vpx_codec_ctx()" location="f1:194" file="f1" line="194" endline="194" inline="1">
  </Destructor>
  <OperatorMethod id="_294" name="=" returns="_358" artificial="1" throw="" context="_67" access="public" mangled="_ZN13vpx_codec_ctxaSERKS_" demangled="vpx_codec_ctx::operator=(vpx_codec_ctx const&amp;)" location="f1:194" file="f1" line="194" endline="194" inline="1">
    <Argument type="_359" location="f1:194" file="f1" line="194"/>
  </OperatorMethod>
  <Constructor id="_295" name="vpx_codec_ctx" artificial="1" throw="" context="_67" access="public" mangled="_ZN13vpx_codec_ctxC1ERKS_ *INTERNAL* " demangled="vpx_codec_ctx::vpx_codec_ctx(vpx_codec_ctx const&amp;)" location="f1:194" file="f1" line="194" endline="194" inline="1">
    <Argument type="_359" location="f1:194" file="f1" line="194"/>
  </Constructor>
  <Constructor id="_296" name="vpx_codec_ctx" artificial="1" throw="" context="_67" access="public" mangled="_ZN13vpx_codec_ctxC1Ev *INTERNAL* " demangled="vpx_codec_ctx::vpx_codec_ctx()" location="f1:194" file="f1" line="194" inline="1"/>
  <PointerType id="_297" type="_266" size="32" align="32"/>
  <Field id="_298" name="fmt" type="_244" offset="0" context="_73" access="public" location="f4:99" file="f4" line="99"/>
  <Field id="_299" name="w" type="_101" offset="32" context="_73" access="public" location="f4:102" file="f4" line="102"/>
  <Field id="_300" name="h" type="_101" offset="64" context="_73" access="public" location="f4:103" file="f4" line="103"/>
  <Field id="_301" name="d_w" type="_101" offset="96" context="_73" access="public" location="f4:106" file="f4" line="106"/>
  <Field id="_302" name="d_h" type="_101" offset="128" context="_73" access="public" location="f4:107" file="f4" line="107"/>
  <Field id="_303" name="x_chroma_shift" type="_101" offset="160" context="_73" access="public" location="f4:110" file="f4" line="110"/>
  <Field id="_304" name="y_chroma_shift" type="_101" offset="192" context="_73" access="public" location="f4:111" file="f4" line="111"/>
  <Field id="_305" name="planes" type="_360" offset="224" context="_73" access="public" location="f4:126" file="f4" line="126"/>
  <Field id="_306" name="stride" type="_361" offset="352" context="_73" access="public" location="f4:127" file="f4" line="127"/>
  <Field id="_307" name="bps" type="_45" offset="480" context="_73" access="public" location="f4:129" file="f4" line="129"/>
  <Field id="_308" name="user_priv" type="_297" offset="512" context="_73" access="public" location="f4:134" file="f4" line="134"/>
  <Field id="_309" name="img_data" type="_337" offset="544" context="_73" access="public" location="f4:138" file="f4" line="138"/>
  <Field id="_310" name="img_data_owner" type="_45" offset="576" context="_73" access="public" location="f4:139" file="f4" line="139"/>
  <Field id="_311" name="self_allocd" type="_45" offset="608" context="_73" access="public" location="f4:140" file="f4" line="140"/>
  <Destructor id="_312" name="vpx_image" artificial="1" throw="" context="_73" access="public" mangled="_ZN9vpx_imageD1Ev *INTERNAL* " demangled="vpx_image::~vpx_image()" location="f4:98" file="f4" line="98" endline="98" inline="1">
  </Destructor>
  <OperatorMethod id="_313" name="=" returns="_362" artificial="1" throw="" context="_73" access="public" mangled="_ZN9vpx_imageaSERKS_" demangled="vpx_image::operator=(vpx_image const&amp;)" location="f4:98" file="f4" line="98" endline="98" inline="1">
    <Argument type="_363" location="f4:98" file="f4" line="98"/>
  </OperatorMethod>
  <Constructor id="_314" name="vpx_image" artificial="1" throw="" context="_73" access="public" mangled="_ZN9vpx_imageC1ERKS_ *INTERNAL* " demangled="vpx_image::vpx_image(vpx_image const&amp;)" location="f4:98" file="f4" line="98" endline="98" inline="1">
    <Argument type="_363" location="f4:98" file="f4" line="98"/>
  </Constructor>
  <Constructor id="_315" name="vpx_image" artificial="1" throw="" context="_73" access="public" mangled="_ZN9vpx_imageC1Ev *INTERNAL* " demangled="vpx_image::vpx_image()" location="f4:98" file="f4" line="98" inline="1"/>
  <PointerType id="_316" type="_43" size="32" align="32"/>
  <PointerType id="_317" type="_196" size="32" align="32"/>
  <Field id="_318" name="post_proc_flag" type="_45" offset="0" context="_90" access="public" location="f6:81" file="f6" line="81"/>
  <Field id="_319" name="deblocking_level" type="_45" offset="32" context="_90" access="public" location="f6:82" file="f6" line="82"/>
  <Field id="_320" name="noise_level" type="_45" offset="64" context="_90" access="public" location="f6:83" file="f6" line="83"/>
  <Destructor id="_321" name="vp8_postproc_cfg" artificial="1" throw="" context="_90" access="public" mangled="_ZN16vp8_postproc_cfgD1Ev *INTERNAL* " demangled="vp8_postproc_cfg::~vp8_postproc_cfg()" location="f6:80" file="f6" line="80" endline="80" inline="1">
  </Destructor>
  <OperatorMethod id="_322" name="=" returns="_364" artificial="1" throw="" context="_90" access="public" mangled="_ZN16vp8_postproc_cfgaSERKS_" demangled="vp8_postproc_cfg::operator=(vp8_postproc_cfg const&amp;)" location="f6:80" file="f6" line="80" endline="80" inline="1">
    <Argument type="_365" location="f6:80" file="f6" line="80"/>
  </OperatorMethod>
  <Constructor id="_323" name="vp8_postproc_cfg" artificial="1" throw="" context="_90" access="public" mangled="_ZN16vp8_postproc_cfgC1ERKS_ *INTERNAL* " demangled="vp8_postproc_cfg::vp8_postproc_cfg(vp8_postproc_cfg const&amp;)" location="f6:80" file="f6" line="80" endline="80" inline="1">
    <Argument type="_365" location="f6:80" file="f6" line="80"/>
  </Constructor>
  <Constructor id="_324" name="vp8_postproc_cfg" artificial="1" throw="" context="_90" access="public" mangled="_ZN16vp8_postproc_cfgC1Ev *INTERNAL* " demangled="vp8_postproc_cfg::vp8_postproc_cfg()" location="f6:80" file="f6" line="80" inline="1"/>
  <Field id="_325" name="frame_type" type="_174" offset="0" context="_100" access="public" location="f6:104" file="f6" line="104"/>
  <Field id="_326" name="img" type="_74" offset="32" context="_100" access="public" location="f6:105" file="f6" line="105"/>
  <Destructor id="_327" name="vpx_ref_frame" artificial="1" throw="" context="_100" access="public" mangled="_ZN13vpx_ref_frameD1Ev *INTERNAL* " demangled="vpx_ref_frame::~vpx_ref_frame()" location="f6:103" file="f6" line="103" endline="103" inline="1">
  </Destructor>
  <OperatorMethod id="_328" name="=" returns="_366" artificial="1" throw="" context="_100" access="public" mangled="_ZN13vpx_ref_frameaSERKS_" demangled="vpx_ref_frame::operator=(vpx_ref_frame const&amp;)" location="f6:103" file="f6" line="103" endline="103" inline="1">
    <Argument type="_367" location="f6:103" file="f6" line="103"/>
  </OperatorMethod>
  <Constructor id="_329" name="vpx_ref_frame" artificial="1" throw="" context="_100" access="public" mangled="_ZN13vpx_ref_frameC1ERKS_ *INTERNAL* " demangled="vpx_ref_frame::vpx_ref_frame(vpx_ref_frame const&amp;)" location="f6:103" file="f6" line="103" endline="103" inline="1">
    <Argument type="_367" location="f6:103" file="f6" line="103"/>
  </Constructor>
  <Constructor id="_330" name="vpx_ref_frame" artificial="1" throw="" context="_100" access="public" mangled="_ZN13vpx_ref_frameC1Ev *INTERNAL* " demangled="vpx_ref_frame::vpx_ref_frame()" location="f6:103" file="f6" line="103" inline="1"/>
  <PointerType id="_331" type="_247" size="32" align="32"/>
  <PointerType id="_332" type="_248" size="32" align="32"/>
  <PointerType id="_333" type="_176" size="32" align="32"/>
  <PointerType id="_334" type="_368c" size="32" align="32"/>
  <PointerType id="_335" type="_370" size="32" align="32"/>
  <PointerType id="_336" type="_63" size="32" align="32"/>
  <PointerType id="_337" type="_188" size="32" align="32"/>
  <CvQualifiedType id="_127c" type="_127" const="1"/>
  <ReferenceType id="_341" type="_7" size="32" align="32"/>
  <ReferenceType id="_342" type="_7c" size="32" align="32"/>
  <ReferenceType id="_343" type="_11" size="32" align="32"/>
  <ReferenceType id="_344" type="_11c" size="32" align="32"/>
  <FundamentalType id="_345" name="long unsigned int" size="32" align="32"/>
  <PointerType id="_346" type="_373" size="32" align="32"/>
  <ReferenceType id="_347" type="_42" size="32" align="32"/>
  <ReferenceType id="_348" type="_42c" size="32" align="32"/>
  <PointerType id="_350" type="_153" size="32" align="32"/>
  <Field id="_351" name="dec" type="_375" offset="0" context="_292" access="public" location="f1:202" file="f1" line="202"/>
  <Field id="_352" name="enc" type="_376" offset="0" context="_292" access="public" location="f1:203" file="f1" line="203"/>
  <Field id="_353" name="raw" type="_297" offset="0" context="_292" access="public" location="f1:204" file="f1" line="204"/>
  <Destructor id="_354" name="$_2" artificial="1" throw="" context="_292" access="public" mangled="_ZN13vpx_codec_ctx3$_2D1Ev *INTERNAL* " demangled="vpx_codec_ctx::$_2::~$_2()" location="f1:201" file="f1" line="201" endline="201" inline="1">
  </Destructor>
  <OperatorMethod id="_355" name="=" returns="_377" artificial="1" throw="" context="_292" access="public" mangled="_ZN13vpx_codec_ctx3$_2aSERKS0_" demangled="vpx_codec_ctx::$_2::operator=(vpx_codec_ctx::$_2 const&amp;)" location="f1:201" file="f1" line="201" endline="201" inline="1">
    <Argument type="_378" location="f1:201" file="f1" line="201"/>
  </OperatorMethod>
  <Constructor id="_356" name="vpx_codec_ctx" artificial="1" throw="" context="_292" access="public" mangled="_ZN13vpx_codec_ctx3$_2C1ERKS0_ *INTERNAL* " demangled="vpx_codec_ctx::$_2::$_2(vpx_codec_ctx::$_2 const&amp;)" location="f1:201" file="f1" line="201" endline="201" inline="1">
    <Argument type="_378" location="f1:201" file="f1" line="201"/>
  </Constructor>
  <Constructor id="_357" name="vpx_codec_ctx" artificial="1" throw="" context="_292" access="public" mangled="_ZN13vpx_codec_ctx3$_2C1Ev *INTERNAL* " demangled="vpx_codec_ctx::$_2::$_2()" location="f1:201" file="f1" line="201" inline="1"/>
  <ReferenceType id="_358" type="_67" size="32" align="32"/>
  <ReferenceType id="_359" type="_67c" size="32" align="32"/>
  <ArrayType id="_360" min="0" max="3u" type="_337" size="128" align="32"/>
  <ArrayType id="_361" min="0" max="3u" type="_45" size="128" align="32"/>
  <ReferenceType id="_362" type="_73" size="32" align="32"/>
  <ReferenceType id="_363" type="_73c" size="32" align="32"/>
  <ReferenceType id="_364" type="_90" size="32" align="32"/>
  <ReferenceType id="_365" type="_90c" size="32" align="32"/>
  <ReferenceType id="_366" type="_100" size="32" align="32"/>
  <ReferenceType id="_367" type="_100c" size="32" align="32"/>
  <PointerType id="_375" type="_66" size="32" align="32"/>
  <PointerType id="_376" type="_151" size="32" align="32"/>
  <ReferenceType id="_377" type="_292" size="32" align="32"/>
  <ReferenceType id="_378" type="_292c" size="32" align="32"/>
  <CvQualifiedType id="_266c" type="_266" const="1"/>
  <CvQualifiedType id="_73c" type="_73" const="1"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <CvQualifiedType id="_368c" type="_368" const="1"/>
  <CvQualifiedType id="_292c" type="_292" const="1"/>
  <CvQualifiedType id="_67c" type="_67" const="1"/>
  <FunctionType id="_373" returns="_266">
    <Argument type="_384"/>
  </FunctionType>
  <CvQualifiedType id="_42c" type="_42" const="1"/>
  <CvQualifiedType id="_90c" type="_90" const="1"/>
  <CvQualifiedType id="_100c" type="_100" const="1"/>
  <FundamentalType id="_339" name="char" size="8" align="8"/>
  <PointerType id="_349" type="_339" size="32" align="32"/>
  <CvQualifiedType id="_339c" type="_339" const="1"/>
  <FundamentalType id="_368" name="wchar_t" size="16" align="16"/>
  <PointerType id="_370" type="_368" size="32" align="32"/>
  <PointerType id="_384" type="_42" size="32" align="32"/>
  <File id="f0" name="/usr/local/share/gccxml-0.9/GCC/4.5/gccxml_builtins.h"/>
  <File id="f1" name="../vpxmt/include/vpx/vpx_codec.h"/>
  <File id="f2" name="/usr/include/inttypes.h"/>
  <File id="f3" name="/usr/include/stdint.h"/>
  <File id="f4" name="../vpxmt/include/vpx/vpx_image.h"/>
  <File id="f5" name="../vpxmt/include/vpx/vp8dx.h"/>
  <File id="f6" name="../vpxmt/include/vpx/vp8.h"/>
  <File id="f7" name="/usr/lib/gcc/i686-pc-cygwin/4.5.3/include/stddef.h"/>
</GCC_XML>
