<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">
  <Namespace id="_1" name="::" members="_3 _4 _5 _6 _8 _10 _12 _13 _14 _15 _16 _17 _18 _19 _21 _22 _23 _24 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _45 _46 _47 _48 _50 _51 _53 _54 _55 _56 _57 _58 _59 _60 _61 _62 _63 _64 _49 _65 _66 _67 _69 _11 _71 _72 _74 _76 _77 _79 _81 _82 _83 _84 _85 _86 _87 _88 _89 _90 _91 _92 _93 _94 _95 _96 _97 _98 _99 _100 _101 _102 _103 _104 _105 _106 _107 _80 _108 _110 _111 _112 _113 _114 _115 _116 _117 _118 _119 _120 _121 _122 _123 _124 _125 _126 _127 _128 _129 _130 _131 _132 _133 _134 _135 _136 _138 _139 _140 _141 _142 _143 _144 _145 _146 _147 _148 _149 _150 _151 _152 _153 _109 _155 _156 _157 _158 _2 _159 _160 _161 _162 _163 _164 _165 _166 _167 _168 _154 _169 _170 _171 _172 _173 _174 _175 _176 _177 _20 _178 _179 _180 _181 _182 _183 _184 _185 _187 _188 _189 _191 _192 _193 _194 _195 _196 _197 _78 _198 _199 _200 _201 _202 _203 _204 _7 _205 _206 _207 _208 _209 _210 _211 _212 _213 _214 _215 _216 _217 _218 _219 _220 _221 _222 _223 _224 _225 _226 _227 _228 _229 _230 _231 _73 _232 _233 _234 _235 _236 _237 _238 _239 _240 _241 _242 _243 _244 _245 _246 " mangled="_Z2::" demangled="::"/>
  <Namespace id="_2" name="std" context="_1" members="" mangled="_Z3std" demangled="std"/>
  <Function id="_3" name="__builtin_nans" returns="_247" context="_1" location="f0:21" file="f0" line="21" extern="1" attributes="nothrow const nonnull">

  <Function id="_222" name="__builtin_ceill" returns="_250" context="_1" mangled="ceill" location="f0:38" file="f0" line="38" extern="1" attributes="nothrow const">
    <Argument type="_250" location="f0:38" file="f0" line="38"/>
  </Function>
  <Function id="_223" name="vpx_codec_control_" returns="_220" context="_1" location="f1:375" file="f1" line="375" extern="1">
    <Argument name="ctx" type="_279" location="f1:375" file="f1" line="375"/>
    <Argument name="ctrl_id" type="_52" location="f1:375" file="f1" line="375"/>
    <Ellipsis/>
  </Function>
  <Function id="_224" name="__builtin_csinf" returns="_266" context="_1" mangled="csinf" location="f0:114" file="f0" line="114" extern="1" attributes="nothrow pure no vops">
    <Argument type="_266" location="f0:114" file="f0" line="114"/>
  </Function>
  <Function id="_225" name="__builtin_csinh" returns="_278" context="_1" mangled="csinh" location="f0:118" file="f0" line="118" extern="1" attributes="nothrow pure no vops">
    <Argument type="_278" location="f0:118" file="f0" line="118"/>
  </Function>
  <Function id="_226" name="__builtin_csinl" returns="_267" context="_1" mangled="csinl" location="f0:116" file="f0" line="116" extern="1" attributes="nothrow pure no vops">
    <Argument type="_267" location="f0:116" file="f0" line="116"/>
  </Function>
  <Function id="_227" name="__builtin_acos" returns="_247" context="_1" mangled="acos" location="f0:24" file="f0" line="24" extern="1" attributes="nothrow">
    <Argument type="_247" location="f0:24" file="f0" line="24"/>
  </Function>
  <Function id="_228" name="__builtin_ctzll" returns="_52" context="_1" location="f0:98" file="f0" line="98" extern="1" attributes="nothrow const">
    <Argument type="_44" location="f0:98" file="f0" line="98"/>
  </Function>
  <Typedef id="_229" name="uint_fast32_t" type="_25" context="_1" location="f3:53" file="f3" line="53"/>
  <Function id="_230" name="__builtin_cargf" returns="_249" context="_1" mangled="cargf" location="f0:93" file="f0" line="93" extern="1" attributes="nothrow pure no vops">
    <Argument type="_266" location="f0:93" file="f0" line="93"/>
  </Function>
  <Function id="_231" name="__builtin_cargl" returns="_250" context="_1" mangled="cargl" location="f0:95" file="f0" line="95" extern="1" attributes="nothrow pure no vops">
    <Argument type="_267" location="f0:95" file="f0" line="95"/>
  </Function>
  <Function id="_232" name="imaxabs" returns="_188" context="_1" location="f2:235" file="f2" line="235" extern="1" attributes="nothrow const __cdecl__">
    <Argument type="_188" location="f2:235" file="f2" line="235"/>
  </Function>
  <Function id="_233" name="__builtin_cosf" returns="_249" context="_1" mangled="cosf" location="f0:40" file="f0" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_249" location="f0:40" file="f0" line="40"/>
  </Function>
  <Function id="_234" name="__builtin_cosh" returns="_247" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow">
    <Argument type="_247" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_235" name="__builtin_cosl" returns="_250" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_250" location="f0:44" file="f0" line="44"/>
  </Function>
  <Function id="_236" name="__builtin_isgreater" returns="_257" context="_1" location="f0:137" file="f0" line="137" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Typedef id="_237" name="uint_least8_t" type="_190" context="_1" location="f3:39" file="f3" line="39"/>
  <Typedef id="_238" name="vpx_codec_cx_pkt_t" type="_174" context="_1" location="f5:192" file="f5" line="192"/>
  <Function id="_239" name="vpx_codec_iface_name" returns="_248" context="_1" location="f1:277" file="f1" line="277" extern="1">
    <Argument name="iface" type="_274" location="f1:277" file="f1" line="277"/>
  </Function>
  <Function id="_240" name="__builtin_sinf" returns="_249" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_249" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_241" name="__builtin_sinh" returns="_247" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_247" location="f0:77" file="f0" line="77"/>
  </Function>
  <Function id="_242" name="__builtin_sinl" returns="_250" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_250" location="f0:80" file="f0" line="80"/>
  </Function>
  <Typedef id="_243" name="uint64_t" type="_9" context="_1" location="f3:30" file="f3" line="30"/>
  <Function id="_244" name="__builtin_csin" returns="_278" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_278" location="f0:115" file="f0" line="115"/>
  </Function>
  <Function id="_245" name="vpx_codec_enc_init_multi_ver" returns="_220" context="_1" location="f5:707" file="f5" line="707" extern="1">
    <Argument name="ctx" type="_279" location="f5:707" file="f5" line="707"/>
    <Argument name="iface" type="_274" location="f5:707" file="f5" line="707"/>
    <Argument name="cfg" type="_275" location="f5:707" file="f5" line="707"/>
    <Argument name="num_enc" type="_52" location="f5:707" file="f5" line="707"/>
    <Argument name="flags" type="_76" location="f5:707" file="f5" line="707"/>
    <Argument name="dsf" type="_390" location="f5:707" file="f5" line="707"/>
    <Argument name="ver" type="_52" location="f5:707" file="f5" line="707"/>
  </Function>
  <Typedef id="_246" name="vpx_img_fmt_t" type="_91" context="_1" location="f4:60" file="f4" line="60"/>
  <FundamentalType id="_247" name="double" size="64" align="64"/>
  <PointerType id="_248" type="_391c" size="32" align="32"/>
  <FundamentalType id="_249" name="float" size="32" align="32"/>
  <FundamentalType id="_250" name="long double" size="96" align="32"/>
  <Field id="_251" name="quot" type="_188" offset="0" context="_7" access="public" location="f2:231" file="f2" line="231"/>
  <Field id="_252" name="rem" type="_188" offset="64" context="_7" access="public" location="f2:232" file="f2" line="232"/>
  <Destructor id="_253" name="$_0" artificial="1" throw="" context="_7" access="public" mangled="_ZN9imaxdiv_tD1Ev *INTERNAL* " demangled="imaxdiv_t::~imaxdiv_t()" location="f2:233" file="f2" line="233" endline="233" inline="1">
  </Destructor>
  <OperatorMethod id="_254" name="=" returns="_393" artificial="1" throw="" context="_7" access="public" mangled="_ZN9imaxdiv_taSERKS_" demangled="imaxdiv_t::operator=(imaxdiv_t const&amp;)" location="f2:233" file="f2" line="233" endline="233" inline="1">
    <Argument type="_394" location="f2:230" file="f2" line="230"/>
  </OperatorMethod>
  <Constructor id="_255" name="$_0" artificial="1" throw="" context="_7" access="public" mangled="_ZN9imaxdiv_tC1ERKS_ *INTERNAL* " demangled="imaxdiv_t::imaxdiv_t(imaxdiv_t const&amp;)" location="f2:233" file="f2" line="233" endline="233" inline="1">
    <Argument type="_394" location="f2:230" file="f2" line="230"/>
  </Constructor>
  <Constructor id="_256" name="$_0" artificial="1" throw="" context="_7" access="public" mangled="_ZN9imaxdiv_tC1Ev *INTERNAL* " demangled="imaxdiv_t::imaxdiv_t()" location="f2:233" file="f2" line="233" inline="1"/>
  <FundamentalType id="_257" name="bool" size="8" align="8"/>
  <Field id="_258" name="x" type="_25" offset="0" context="_11" access="public" location="f4:146" file="f4" line="146"/>
  <Field id="_259" name="y" type="_25" offset="32" context="_11" access="public" location="f4:147" file="f4" line="147"/>
  <Field id="_260" name="w" type="_25" offset="64" context="_11" access="public" location="f4:148" file="f4" line="148"/>
  <Field id="_261" name="h" type="_25" offset="96" context="_11" access="public" location="f4:149" file="f4" line="149"/>
  <Destructor id="_262" name="vpx_image_rect" artificial="1" throw="" context="_11" access="public" mangled="_ZN14vpx_image_rectD1Ev *INTERNAL* " demangled="vpx_image_rect::~vpx_image_rect()" location="f4:145" file="f4" line="145" endline="145" inline="1">
  </Destructor>
  <OperatorMethod id="_263" name="=" returns="_395" artificial="1" throw="" context="_11" access="public" mangled="_ZN14vpx_image_rectaSERKS_" demangled="vpx_image_rect::operator=(vpx_image_rect const&amp;)" location="f4:145" file="f4" line="145" endline="145" inline="1">
    <Argument type="_396" location="f4:145" file="f4" line="145"/>
  </OperatorMethod>
  <Constructor id="_264" name="vpx_image_rect" artificial="1" throw="" context="_11" access="public" mangled="_ZN14vpx_image_rectC1ERKS_ *INTERNAL* " demangled="vpx_image_rect::vpx_image_rect(vpx_image_rect const&amp;)" location="f4:145" file="f4" line="145" endline="145" inline="1">
    <Argument type="_396" location="f4:145" file="f4" line="145"/>
  </Constructor>
  <Constructor id="_265" name="vpx_image_rect" artificial="1" throw="" context="_11" access="public" mangled="_ZN14vpx_image_rectC1Ev *INTERNAL* " demangled="vpx_image_rect::vpx_image_rect()" location="f4:145" file="f4" line="145" inline="1"/>
  <FundamentalType id="_266" name="complex float" size="64" align="32"/>
  <FundamentalType id="_267" name="complex long double" size="192" align="32"/>
  <Field id="_268" name="buf" type="_307" offset="0" context="_20" access="public" location="f5:86" file="f5" line="86"/>
  <Field id="_269" name="sz" type="_171" offset="32" context="_20" access="public" location="f5:87" file="f5" line="87"/>
  <Destructor id="_270" name="vpx_fixed_buf" artificial="1" throw="" context="_20" access="public" mangled="_ZN13vpx_fixed_bufD1Ev *INTERNAL* " demangled="vpx_fixed_buf::~vpx_fixed_buf()" location="f5:85" file="f5" line="85" endline="85" inline="1">
  </Destructor>
  <OperatorMethod id="_271" name="=" returns="_397" artificial="1" throw="" context="_20" access="public" mangled="_ZN13vpx_fixed_bufaSERKS_" demangled="vpx_fixed_buf::operator=(vpx_fixed_buf const&amp;)" location="f5:85" file="f5" line="85" endline="85" inline="1">
    <Argument type="_398" location="f5:85" file="f5" line="85"/>
  </OperatorMethod>
  <Constructor id="_272" name="vpx_fixed_buf" artificial="1" throw="" context="_20" access="public" mangled="_ZN13vpx_fixed_bufC1ERKS_ *INTERNAL* " demangled="vpx_fixed_buf::vpx_fixed_buf(vpx_fixed_buf const&amp;)" location="f5:85" file="f5" line="85" endline="85" inline="1">
    <Argument type="_398" location="f5:85" file="f5" line="85"/>
  </Constructor>
  <Constructor id="_273" name="vpx_fixed_buf" artificial="1" throw="" context="_20" access="public" mangled="_ZN13vpx_fixed_bufC1Ev *INTERNAL* " demangled="vpx_fixed_buf::vpx_fixed_buf()" location="f5:85" file="f5" line="85" inline="1"/>
  <PointerType id="_274" type="_199" size="32" align="32"/>
  <PointerType id="_275" type="_110" size="32" align="32"/>
  <FundamentalType id="_276" name="void" align="8"/>
  <PointerType id="_277" type="_81" size="32" align="32"/>
  <FundamentalType id="_278" name="complex double" size="128" align="64"/>
  <PointerType id="_279" type="_74" size="32" align="32"/>
  <Field id="_280" name="id" type="_25" offset="0" context="_49" access="public" location="f1:481" file="f1" line="481"/>
  <Field id="_281" name="sz" type="_386" offset="32" context="_49" access="public" location="f1:482" file="f1" line="482"/>
  <Field id="_282" name="align" type="_25" offset="64" context="_49" access="public" location="f1:483" file="f1" line="483"/>
  <Field id="_283" name="flags" type="_25" offset="96" context="_49" access="public" location="f1:484" file="f1" line="484"/>
  <Field id="_284" name="base" type="_307" offset="128" context="_49" access="public" location="f1:490" file="f1" line="490"/>
  <Field id="_285" name="dtor" type="_399" offset="160" context="_49" access="public" location="f1:491" file="f1" line="491"/>
  <Field id="_286" name="priv" type="_307" offset="192" context="_49" access="public" location="f1:492" file="f1" line="492"/>
  <Destructor id="_287" name="vpx_codec_mmap" artificial="1" throw="" context="_49" access="public" mangled="_ZN14vpx_codec_mmapD1Ev *INTERNAL* " demangled="vpx_codec_mmap::~vpx_codec_mmap()" location="f1:477" file="f1" line="477" endline="477" inline="1">
  </Destructor>
  <OperatorMethod id="_288" name="=" returns="_400" artificial="1" throw="" context="_49" access="public" mangled="_ZN14vpx_codec_mmapaSERKS_" demangled="vpx_codec_mmap::operator=(vpx_codec_mmap const&amp;)" location="f1:477" file="f1" line="477" endline="477" inline="1">
    <Argument type="_401" location="f1:477" file="f1" line="477"/>
  </OperatorMethod>
  <Constructor id="_289" name="vpx_codec_mmap" artificial="1" throw="" context="_49" access="public" mangled="_ZN14vpx_codec_mmapC1ERKS_ *INTERNAL* " demangled="vpx_codec_mmap::vpx_codec_mmap(vpx_codec_mmap const&amp;)" location="f1:477" file="f1" line="477" endline="477" inline="1">
    <Argument type="_401" location="f1:477" file="f1" line="477"/>
  </Constructor>
  <Constructor id="_290" name="vpx_codec_mmap" artificial="1" throw="" context="_49" access="public" mangled="_ZN14vpx_codec_mmapC1Ev *INTERNAL* " demangled="vpx_codec_mmap::vpx_codec_mmap()" location="f1:477" file="f1" line="477" inline="1"/>
  <PointerType id="_291" type="_238c" size="32" align="32"/>
  <PointerType id="_292" type="_69" size="32" align="32"/>
  <PointerType id="_293" type="_403" size="32" align="32"/>
  <Field id="_295" name="name" type="_248" offset="0" context="_73" access="public" location="f1:195" file="f1" line="195"/>
  <Field id="_296" name="iface" type="_274" offset="32" context="_73" access="public" location="f1:196" file="f1" line="196"/>
  <Field id="_297" name="err" type="_220" offset="64" context="_73" access="public" location="f1:197" file="f1" line="197"/>
  <Field id="_298" name="err_detail" type="_248" offset="96" context="_73" access="public" location="f1:198" file="f1" line="198"/>
  <Field id="_299" name="init_flags" type="_76" offset="128" context="_73" access="public" location="f1:199" file="f1" line="199"/>
  <Field id="_300" name="config" type="_302" offset="160" context="_73" access="public" location="f1:205" file="f1" line="205"/>
  <Field id="_301" name="priv" type="_404" offset="192" context="_73" access="public" location="f1:206" file="f1" line="206"/>
  <Union id="_302" context="_73" access="public" mangled="N13vpx_codec_ctx3$_2E" demangled="vpx_codec_ctx::$_2" location="f1:201" file="f1" line="201" artificial="1" size="32" align="32" members="_405 _406 _407 _408 _409 _410 _411 " bases=""/>
  <Destructor id="_303" name="vpx_codec_ctx" artificial="1" throw="" context="_73" access="public" mangled="_ZN13vpx_codec_ctxD1Ev *INTERNAL* " demangled="vpx_codec_ctx::~vpx_codec_ctx()" location="f1:194" file="f1" line="194" endline="194" inline="1">
  </Destructor>
  <OperatorMethod id="_304" name="=" returns="_412" artificial="1" throw="" context="_73" access="public" mangled="_ZN13vpx_codec_ctxaSERKS_" demangled="vpx_codec_ctx::operator=(vpx_codec_ctx const&amp;)" location="f1:194" file="f1" line="194" endline="194" inline="1">
    <Argument type="_413" location="f1:194" file="f1" line="194"/>
  </OperatorMethod>
  <Constructor id="_305" name="vpx_codec_ctx" artificial="1" throw="" context="_73" access="public" mangled="_ZN13vpx_codec_ctxC1ERKS_ *INTERNAL* " demangled="vpx_codec_ctx::vpx_codec_ctx(vpx_codec_ctx const&amp;)" location="f1:194" file="f1" line="194" endline="194" inline="1">
    <Argument type="_413" location="f1:194" file="f1" line="194"/>
  </Constructor>
  <Constructor id="_306" name="vpx_codec_ctx" artificial="1" throw="" context="_73" access="public" mangled="_ZN13vpx_codec_ctxC1Ev *INTERNAL* " demangled="vpx_codec_ctx::vpx_codec_ctx()" location="f1:194" file="f1" line="194" inline="1"/>
  <PointerType id="_307" type="_276" size="32" align="32"/>
  <Field id="_308" name="num" type="_52" offset="0" context="_78" access="public" location="f5:201" file="f5" line="201"/>
  <Field id="_309" name="den" type="_52" offset="32" context="_78" access="public" location="f5:202" file="f5" line="202"/>
  <Destructor id="_310" name="vpx_rational" artificial="1" throw="" context="_78" access="public" mangled="_ZN12vpx_rationalD1Ev *INTERNAL* " demangled="vpx_rational::~vpx_rational()" location="f5:200" file="f5" line="200" endline="200" inline="1">
  </Destructor>
  <OperatorMethod id="_311" name="=" returns="_414" artificial="1" throw="" context="_78" access="public" mangled="_ZN12vpx_rationalaSERKS_" demangled="vpx_rational::operator=(vpx_rational const&amp;)" location="f5:200" file="f5" line="200" endline="200" inline="1">
    <Argument type="_415" location="f5:200" file="f5" line="200"/>
  </OperatorMethod>
  <Constructor id="_312" name="vpx_rational" artificial="1" throw="" context="_78" access="public" mangled="_ZN12vpx_rationalC1ERKS_ *INTERNAL* " demangled="vpx_rational::vpx_rational(vpx_rational const&amp;)" location="f5:200" file="f5" line="200" endline="200" inline="1">
    <Argument type="_415" location="f5:200" file="f5" line="200"/>
  </Constructor>
  <Constructor id="_313" name="vpx_rational" artificial="1" throw="" context="_78" access="public" mangled="_ZN12vpx_rationalC1Ev *INTERNAL* " demangled="vpx_rational::vpx_rational()" location="f5:200" file="f5" line="200" inline="1"/>
  <Field id="_314" name="fmt" type="_246" offset="0" context="_80" access="public" location="f4:99" file="f4" line="99"/>
  <Field id="_315" name="w" type="_25" offset="32" context="_80" access="public" location="f4:102" file="f4" line="102"/>
  <Field id="_316" name="h" type="_25" offset="64" context="_80" access="public" location="f4:103" file="f4" line="103"/>
  <Field id="_317" name="d_w" type="_25" offset="96" context="_80" access="public" location="f4:106" file="f4" line="106"/>
  <Field id="_318" name="d_h" type="_25" offset="128" context="_80" access="public" location="f4:107" file="f4" line="107"/>
  <Field id="_319" name="x_chroma_shift" type="_25" offset="160" context="_80" access="public" location="f4:110" file="f4" line="110"/>
  <Field id="_320" name="y_chroma_shift" type="_25" offset="192" context="_80" access="public" location="f4:111" file="f4" line="111"/>
  <Field id="_321" name="planes" type="_416" offset="224" context="_80" access="public" location="f4:126" file="f4" line="126"/>
  <Field id="_322" name="stride" type="_417" offset="352" context="_80" access="public" location="f4:127" file="f4" line="127"/>
  <Field id="_323" name="bps" type="_52" offset="480" context="_80" access="public" location="f4:129" file="f4" line="129"/>
  <Field id="_324" name="user_priv" type="_307" offset="512" context="_80" access="public" location="f4:134" file="f4" line="134"/>
  <Field id="_325" name="img_data" type="_387" offset="544" context="_80" access="public" location="f4:138" file="f4" line="138"/>
  <Field id="_326" name="img_data_owner" type="_52" offset="576" context="_80" access="public" location="f4:139" file="f4" line="139"/>
  <Field id="_327" name="self_allocd" type="_52" offset="608" context="_80" access="public" location="f4:140" file="f4" line="140"/>
  <Destructor id="_328" name="vpx_image" artificial="1" throw="" context="_80" access="public" mangled="_ZN9vpx_imageD1Ev *INTERNAL* " demangled="vpx_image::~vpx_image()" location="f4:98" file="f4" line="98" endline="98" inline="1">
  </Destructor>
  <OperatorMethod id="_329" name="=" returns="_418" artificial="1" throw="" context="_80" access="public" mangled="_ZN9vpx_imageaSERKS_" demangled="vpx_image::operator=(vpx_image const&amp;)" location="f4:98" file="f4" line="98" endline="98" inline="1">
    <Argument type="_419" location="f4:98" file="f4" line="98"/>
  </OperatorMethod>
  <Constructor id="_330" name="vpx_image" artificial="1" throw="" context="_80" access="public" mangled="_ZN9vpx_imageC1ERKS_ *INTERNAL* " demangled="vpx_image::vpx_image(vpx_image const&amp;)" location="f4:98" file="f4" line="98" endline="98" inline="1">
    <Argument type="_419" location="f4:98" file="f4" line="98"/>
  </Constructor>
  <Constructor id="_331" name="vpx_image" artificial="1" throw="" context="_80" access="public" mangled="_ZN9vpx_imageC1Ev *INTERNAL* " demangled="vpx_image::vpx_image()" location="f4:98" file="f4" line="98" inline="1"/>
  <PointerType id="_332" type="_50" size="32" align="32"/>
  <PointerType id="_333" type="_52" size="32" align="32"/>
  <PointerType id="_334" type="_81c" size="32" align="32"/>
  <Field id="_335" name="g_usage" type="_25" offset="0" context="_109" access="public" location="f5:270" file="f5" line="270"/>
  <Field id="_336" name="g_threads" type="_25" offset="32" context="_109" access="public" location="f5:279" file="f5" line="279"/>
  <Field id="_337" name="g_profile" type="_25" offset="64" context="_109" access="public" location="f5:290" file="f5" line="290"/>
  <Field id="_338" name="g_w" type="_25" offset="96" context="_109" access="public" location="f5:301" file="f5" line="301"/>
  <Field id="_339" name="g_h" type="_25" offset="128" context="_109" access="public" location="f5:311" file="f5" line="311"/>
  <Field id="_340" name="g_timebase" type="_78" offset="160" context="_109" access="public" location="f5:326" file="f5" line="326"/>
  <Field id="_341" name="g_error_resilient" type="_167" offset="224" context="_109" access="public" location="f5:335" file="f5" line="335"/>
  <Field id="_342" name="g_pass" type="_139" offset="256" context="_109" access="public" location="f5:343" file="f5" line="343"/>
  <Field id="_343" name="g_lag_in_frames" type="_25" offset="288" context="_109" access="public" location="f5:358" file="f5" line="358"/>
  <Field id="_344" name="rc_dropframe_thresh" type="_25" offset="320" context="_109" access="public" location="f5:381" file="f5" line="381"/>
  <Field id="_345" name="rc_resize_allowed" type="_25" offset="352" context="_109" access="public" location="f5:391" file="f5" line="391"/>
  <Field id="_346" name="rc_resize_up_thresh" type="_25" offset="384" context="_109" access="public" location="f5:400" file="f5" line="400"/>
  <Field id="_347" name="rc_resize_down_thresh" type="_25" offset="416" context="_109" access="public" location="f5:409" file="f5" line="409"/>
  <Field id="_348" name="rc_end_usage" type="_175" offset="448" context="_109" access="public" location="f5:420" file="f5" line="420"/>
  <Field id="_349" name="rc_twopass_stats_in" type="_20" offset="480" context="_109" access="public" location="f5:428" file="f5" line="428"/>
  <Field id="_350" name="rc_target_bitrate" type="_25" offset="544" context="_109" access="public" location="f5:435" file="f5" line="435"/>
  <Field id="_351" name="rc_min_quantizer" type="_25" offset="576" context="_109" access="public" location="f5:451" file="f5" line="451"/>
  <Field id="_352" name="rc_max_quantizer" type="_25" offset="608" context="_109" access="public" location="f5:462" file="f5" line="462"/>
  <Field id="_353" name="rc_undershoot_pct" type="_25" offset="640" context="_109" access="public" location="f5:480" file="f5" line="480"/>
  <Field id="_354" name="rc_overshoot_pct" type="_25" offset="672" context="_109" access="public" location="f5:493" file="f5" line="493"/>
  <Field id="_355" name="rc_buf_sz" type="_25" offset="704" context="_109" access="public" location="f5:510" file="f5" line="510"/>
  <Field id="_356" name="rc_buf_initial_sz" type="_25" offset="736" context="_109" access="public" location="f5:520" file="f5" line="520"/>
  <Field id="_357" name="rc_buf_optimal_sz" type="_25" offset="768" context="_109" access="public" location="f5:530" file="f5" line="530"/>
  <Field id="_358" name="rc_2pass_vbr_bias_pct" type="_25" offset="800" context="_109" access="public" location="f5:546" file="f5" line="546"/>
  <Field id="_359" name="rc_2pass_vbr_minsection_pct" type="_25" offset="832" context="_109" access="public" location="f5:554" file="f5" line="554"/>
  <Field id="_360" name="rc_2pass_vbr_maxsection_pct" type="_25" offset="864" context="_109" access="public" location="f5:562" file="f5" line="562"/>
  <Field id="_361" name="kf_mode" type="_158" offset="896" context="_109" access="public" location="f5:575" file="f5" line="575"/>
  <Field id="_362" name="kf_min_dist" type="_25" offset="928" context="_109" access="public" location="f5:585" file="f5" line="585"/>
  <Field id="_363" name="kf_max_dist" type="_25" offset="960" context="_109" access="public" location="f5:595" file="f5" line="595"/>
  <Field id="_364" name="ts_number_layers" type="_25" offset="992" context="_109" access="public" location="f5:605" file="f5" line="605"/>
  <Field id="_365" name="ts_target_bitrate" type="_421" offset="1024" context="_109" access="public" location="f5:611" file="f5" line="611"/>
  <Field id="_366" name="ts_rate_decimator" type="_421" offset="1184" context="_109" access="public" location="f5:618" file="f5" line="618"/>
  <Field id="_367" name="ts_periodicity" type="_25" offset="1344" context="_109" access="public" location="f5:627" file="f5" line="627"/>
  <Field id="_368" name="ts_layer_id" type="_422" offset="1376" context="_109" access="public" location="f5:636" file="f5" line="636"/>
  <Destructor id="_369" name="vpx_codec_enc_cfg" artificial="1" throw="" context="_109" access="public" mangled="_ZN17vpx_codec_enc_cfgD1Ev *INTERNAL* " demangled="vpx_codec_enc_cfg::~vpx_codec_enc_cfg()" location="f5:258" file="f5" line="258" endline="258" inline="1">
  </Destructor>
  <OperatorMethod id="_370" name="=" returns="_423" artificial="1" throw="" context="_109" access="public" mangled="_ZN17vpx_codec_enc_cfgaSERKS_" demangled="vpx_codec_enc_cfg::operator=(vpx_codec_enc_cfg const&amp;)" location="f5:258" file="f5" line="258" endline="258" inline="1">
    <Argument type="_424" location="f5:258" file="f5" line="258"/>
  </OperatorMethod>
  <Constructor id="_371" name="vpx_codec_enc_cfg" artificial="1" throw="" context="_109" access="public" mangled="_ZN17vpx_codec_enc_cfgC1ERKS_ *INTERNAL* " demangled="vpx_codec_enc_cfg::vpx_codec_enc_cfg(vpx_codec_enc_cfg const&amp;)" location="f5:258" file="f5" line="258" endline="258" inline="1">
    <Argument type="_424" location="f5:258" file="f5" line="258"/>
  </Constructor>
  <Constructor id="_372" name="vpx_codec_enc_cfg" artificial="1" throw="" context="_109" access="public" mangled="_ZN17vpx_codec_enc_cfgC1Ev *INTERNAL* " demangled="vpx_codec_enc_cfg::vpx_codec_enc_cfg()" location="f5:258" file="f5" line="258" inline="1"/>
  <PointerType id="_373" type="_249" size="32" align="32"/>
  <PointerType id="_374" type="_250" size="32" align="32"/>
  <PointerType id="_375" type="_425c" size="32" align="32"/>
  <PointerType id="_376" type="_427" size="32" align="32"/>
  <PointerType id="_377" type="_21c" size="32" align="32"/>
  <PointerType id="_378" type="_21" size="32" align="32"/>
  <Field id="_379" name="kind" type="_15" offset="0" context="_174" access="public" location="f5:156" file="f5" line="156"/>
  <Field id="_380" name="data" type="_381" offset="64" context="_174" access="public" location="f5:191" file="f5" line="191"/>
  <Union id="_381" context="_174" access="public" mangled="N16vpx_codec_cx_pkt3$_3E" demangled="vpx_codec_cx_pkt::$_3" location="f5:158" file="f5" line="158" artificial="1" size="1024" align="64" members="_429 _430 _431 _432 _433 _434 _435 _436 _437 _438 _439 " bases=""/>
  <Destructor id="_382" name="vpx_codec_cx_pkt" artificial="1" throw="" context="_174" access="public" mangled="_ZN16vpx_codec_cx_pktD1Ev *INTERNAL* " demangled="vpx_codec_cx_pkt::~vpx_codec_cx_pkt()" location="f5:155" file="f5" line="155" endline="155" inline="1">
  </Destructor>
  <OperatorMethod id="_383" name="=" returns="_440" artificial="1" throw="" context="_174" access="public" mangled="_ZN16vpx_codec_cx_pktaSERKS_" demangled="vpx_codec_cx_pkt::operator=(vpx_codec_cx_pkt const&amp;)" location="f5:155" file="f5" line="155" endline="155" inline="1">
    <Argument type="_441" location="f5:155" file="f5" line="155"/>
  </OperatorMethod>
  <Constructor id="_384" name="vpx_codec_cx_pkt" artificial="1" throw="" context="_174" access="public" mangled="_ZN16vpx_codec_cx_pktC1ERKS_ *INTERNAL* " demangled="vpx_codec_cx_pkt::vpx_codec_cx_pkt(vpx_codec_cx_pkt const&amp;)" location="f5:155" file="f5" line="155" endline="155" inline="1">
    <Argument type="_441" location="f5:155" file="f5" line="155"/>
  </Constructor>
  <Constructor id="_385" name="vpx_codec_cx_pkt" artificial="1" throw="" context="_174" access="public" mangled="_ZN16vpx_codec_cx_pktC1Ev *INTERNAL* " demangled="vpx_codec_cx_pkt::vpx_codec_cx_pkt()" location="f5:155" file="f5" line="155" inline="1"/>
  <FundamentalType id="_386" name="long unsigned int" size="32" align="32"/>
  <PointerType id="_387" type="_190" size="32" align="32"/>
  <CvQualifiedType id="_129c" type="_129" const="1"/>
  <PointerType id="_389" type="_110c" size="32" align="32"/>
  <PointerType id="_390" type="_79" size="32" align="32"/>
  <ReferenceType id="_393" type="_7" size="32" align="32"/>
  <ReferenceType id="_394" type="_7c" size="32" align="32"/>
  <ReferenceType id="_395" type="_11" size="32" align="32"/>
  <ReferenceType id="_396" type="_11c" size="32" align="32"/>
  <ReferenceType id="_397" type="_20" size="32" align="32"/>
  <ReferenceType id="_398" type="_20c" size="32" align="32"/>
  <PointerType id="_399" type="_446" size="32" align="32"/>
  <ReferenceType id="_400" type="_49" size="32" align="32"/>
  <ReferenceType id="_401" type="_49c" size="32" align="32"/>
  <PointerType id="_404" type="_155" size="32" align="32"/>
  <Field id="_405" name="dec" type="_448" offset="0" context="_302" access="public" location="f1:202" file="f1" line="202"/>
  <Field id="_406" name="enc" type="_449" offset="0" context="_302" access="public" location="f1:203" file="f1" line="203"/>
  <Field id="_407" name="raw" type="_307" offset="0" context="_302" access="public" location="f1:204" file="f1" line="204"/>
  <Destructor id="_408" name="$_2" artificial="1" throw="" context="_302" access="public" mangled="_ZN13vpx_codec_ctx3$_2D1Ev *INTERNAL* " demangled="vpx_codec_ctx::$_2::~$_2()" location="f1:201" file="f1" line="201" endline="201" inline="1">
  </Destructor>
  <OperatorMethod id="_409" name="=" returns="_450" artificial="1" throw="" context="_302" access="public" mangled="_ZN13vpx_codec_ctx3$_2aSERKS0_" demangled="vpx_codec_ctx::$_2::operator=(vpx_codec_ctx::$_2 const&amp;)" location="f1:201" file="f1" line="201" endline="201" inline="1">
    <Argument type="_451" location="f1:201" file="f1" line="201"/>
  </OperatorMethod>
  <Constructor id="_410" name="vpx_codec_ctx" artificial="1" throw="" context="_302" access="public" mangled="_ZN13vpx_codec_ctx3$_2C1ERKS0_ *INTERNAL* " demangled="vpx_codec_ctx::$_2::$_2(vpx_codec_ctx::$_2 const&amp;)" location="f1:201" file="f1" line="201" endline="201" inline="1">
    <Argument type="_451" location="f1:201" file="f1" line="201"/>
  </Constructor>
  <Constructor id="_411" name="vpx_codec_ctx" artificial="1" throw="" context="_302" access="public" mangled="_ZN13vpx_codec_ctx3$_2C1Ev *INTERNAL* " demangled="vpx_codec_ctx::$_2::$_2()" location="f1:201" file="f1" line="201" inline="1"/>
  <ReferenceType id="_412" type="_73" size="32" align="32"/>
  <ReferenceType id="_413" type="_73c" size="32" align="32"/>
  <ReferenceType id="_414" type="_78" size="32" align="32"/>
  <ReferenceType id="_415" type="_78c" size="32" align="32"/>
  <ArrayType id="_416" min="0" max="3u" type="_387" size="128" align="32"/>
  <ArrayType id="_417" min="0" max="3u" type="_52" size="128" align="32"/>
  <ReferenceType id="_418" type="_80" size="32" align="32"/>
  <ReferenceType id="_419" type="_80c" size="32" align="32"/>
  <ArrayType id="_421" min="0" max="4u" type="_25" size="160" align="32"/>
  <ArrayType id="_422" min="0" max="15u" type="_25" size="512" align="32"/>
  <ReferenceType id="_423" type="_109" size="32" align="32"/>
  <ReferenceType id="_424" type="_109c" size="32" align="32"/>
  <Field id="_429" name="frame" type="_434" offset="0" context="_381" access="public" location="f5:175" file="f5" line="175"/>
  <Field id="_430" name="twopass_stats" type="_20" offset="0" context="_381" access="public" location="f5:176" file="f5" line="176"/>
  <Field id="_431" name="psnr" type="_435" offset="0" context="_381" access="public" location="f5:182" file="f5" line="182"/>
  <Field id="_432" name="raw" type="_20" offset="0" context="_381" access="public" location="f5:183" file="f5" line="183"/>
  <Field id="_433" name="pad" type="_456" offset="0" context="_381" access="public" location="f5:190" file="f5" line="190"/>
  <Struct id="_434" name="packet" context="_381" access="public" mangled="N16vpx_codec_cx_pkt3$_33$_4E" demangled="vpx_codec_cx_pkt::$_3::$_4" location="f5:160" file="f5" line="160" artificial="1" size="256" align="64" members="_457 _458 _459 _460 _461 _462 _463 _464 _465 _466 " bases=""/>
  <Struct id="_435" name="vpx_psnr_pkt" context="_381" access="public" mangled="N16vpx_codec_cx_pkt3$_312vpx_psnr_pktE" demangled="vpx_codec_cx_pkt::$_3::vpx_psnr_pkt" location="f5:178" file="f5" line="178" artificial="1" size="640" align="64" members="_467 _468 _469 _470 _471 _472 _473 " bases=""/>
  <Destructor id="_436" name="$_3" artificial="1" throw="" context="_381" access="public" mangled="_ZN16vpx_codec_cx_pkt3$_3D1Ev *INTERNAL* " demangled="vpx_codec_cx_pkt::$_3::~$_3()" location="f5:158" file="f5" line="158" endline="158" inline="1">
  </Destructor>
  <OperatorMethod id="_437" name="=" returns="_474" artificial="1" throw="" context="_381" access="public" mangled="_ZN16vpx_codec_cx_pkt3$_3aSERKS0_" demangled="vpx_codec_cx_pkt::$_3::operator=(vpx_codec_cx_pkt::$_3 const&amp;)" location="f5:158" file="f5" line="158" endline="158" inline="1">
    <Argument type="_475" location="f5:158" file="f5" line="158"/>
  </OperatorMethod>
  <Constructor id="_438" name="vpx_codec_cx_pkt" artificial="1" throw="" context="_381" access="public" mangled="_ZN16vpx_codec_cx_pkt3$_3C1ERKS0_ *INTERNAL* " demangled="vpx_codec_cx_pkt::$_3::$_3(vpx_codec_cx_pkt::$_3 const&amp;)" location="f5:158" file="f5" line="158" endline="158" inline="1">
    <Argument type="_475" location="f5:158" file="f5" line="158"/>
  </Constructor>
  <Constructor id="_439" name="vpx_codec_cx_pkt" artificial="1" throw="" context="_381" access="public" mangled="_ZN16vpx_codec_cx_pkt3$_3C1Ev *INTERNAL* " demangled="vpx_codec_cx_pkt::$_3::$_3()" location="f5:158" file="f5" line="158" inline="1"/>
  <ReferenceType id="_440" type="_174" size="32" align="32"/>
  <ReferenceType id="_441" type="_174c" size="32" align="32"/>
  <PointerType id="_448" type="_72" size="32" align="32"/>
  <PointerType id="_449" type="_109" size="32" align="32"/>
  <ReferenceType id="_450" type="_302" size="32" align="32"/>
  <ReferenceType id="_451" type="_302c" size="32" align="32"/>
  <ArrayType id="_456" min="0" max="123u" type="_391" size="992" align="8"/>
  <Field id="_457" name="buf" type="_307" offset="0" context="_434" access="public" location="f5:161" file="f5" line="161"/>
  <Field id="_458" name="sz" type="_171" offset="32" context="_434" access="public" location="f5:162" file="f5" line="162"/>
  <Field id="_459" name="pts" type="_208" offset="64" context="_434" access="public" location="f5:163" file="f5" line="163"/>
  <Field id="_460" name="duration" type="_386" offset="128" context="_434" access="public" location="f5:165" file="f5" line="165"/>
  <Field id="_461" name="flags" type="_26" offset="160" context="_434" access="public" location="f5:167" file="f5" line="167"/>
  <Field id="_462" name="partition_id" type="_52" offset="192" context="_434" access="public" location="f5:168" file="f5" line="168"/>
  <Destructor id="_463" name="$_4" artificial="1" throw="" context="_434" access="public" mangled="_ZN16vpx_codec_cx_pkt3$_33$_4D1Ev *INTERNAL* " demangled="vpx_codec_cx_pkt::$_3::$_4::~$_4()" location="f5:160" file="f5" line="160" endline="160" inline="1">
  </Destructor>
  <OperatorMethod id="_464" name="=" returns="_478" artificial="1" throw="" context="_434" access="public" mangled="_ZN16vpx_codec_cx_pkt3$_33$_4aSERKS1_" demangled="vpx_codec_cx_pkt::$_3::$_4::operator=(vpx_codec_cx_pkt::$_3::$_4 const&amp;)" location="f5:160" file="f5" line="160" endline="160" inline="1">
    <Argument type="_479" location="f5:160" file="f5" line="160"/>
  </OperatorMethod>
  <Constructor id="_465" name="packet" artificial="1" throw="" context="_434" access="public" mangled="_ZN16vpx_codec_cx_pkt3$_33$_4C1ERKS1_ *INTERNAL* " demangled="vpx_codec_cx_pkt::$_3::$_4::$_4(vpx_codec_cx_pkt::$_3::$_4 const&amp;)" location="f5:160" file="f5" line="160" endline="160" inline="1">
    <Argument type="_479" location="f5:160" file="f5" line="160"/>
  </Constructor>
  <Constructor id="_466" name="packet" artificial="1" throw="" context="_434" access="public" mangled="_ZN16vpx_codec_cx_pkt3$_33$_4C1Ev *INTERNAL* " demangled="vpx_codec_cx_pkt::$_3::$_4::$_4()" location="f5:160" file="f5" line="160" inline="1"/>
  <Field id="_467" name="samples" type="_480" offset="0" context="_435" access="public" location="f5:179" file="f5" line="179"/>
  <Field id="_468" name="sse" type="_481" offset="128" context="_435" access="public" location="f5:180" file="f5" line="180"/>
  <Field id="_469" name="psnr" type="_482" offset="384" context="_435" access="public" location="f5:181" file="f5" line="181"/>
  <Destructor id="_470" name="vpx_psnr_pkt" artificial="1" throw="" context="_435" access="public" mangled="_ZN16vpx_codec_cx_pkt3$_312vpx_psnr_pktD1Ev *INTERNAL* " demangled="vpx_codec_cx_pkt::$_3::vpx_psnr_pkt::~vpx_psnr_pkt()" location="f5:178" file="f5" line="178" endline="178" inline="1">
  </Destructor>
  <OperatorMethod id="_471" name="=" returns="_483" artificial="1" throw="" context="_435" access="public" mangled="_ZN16vpx_codec_cx_pkt3$_312vpx_psnr_pktaSERKS1_" demangled="vpx_codec_cx_pkt::$_3::vpx_psnr_pkt::operator=(vpx_codec_cx_pkt::$_3::vpx_psnr_pkt const&amp;)" location="f5:178" file="f5" line="178" endline="178" inline="1">
    <Argument type="_484" location="f5:178" file="f5" line="178"/>
  </OperatorMethod>
  <Constructor id="_472" name="vpx_psnr_pkt" artificial="1" throw="" context="_435" access="public" mangled="_ZN16vpx_codec_cx_pkt3$_312vpx_psnr_pktC1ERKS1_ *INTERNAL* " demangled="vpx_codec_cx_pkt::$_3::vpx_psnr_pkt::vpx_psnr_pkt(vpx_codec_cx_pkt::$_3::vpx_psnr_pkt const&amp;)" location="f5:178" file="f5" line="178" endline="178" inline="1">
    <Argument type="_484" location="f5:178" file="f5" line="178"/>
  </Constructor>
  <Constructor id="_473" name="vpx_psnr_pkt" artificial="1" throw="" context="_435" access="public" mangled="_ZN16vpx_codec_cx_pkt3$_312vpx_psnr_pktC1Ev *INTERNAL* " demangled="vpx_codec_cx_pkt::$_3::vpx_psnr_pkt::vpx_psnr_pkt()" location="f5:178" file="f5" line="178" inline="1"/>
  <ReferenceType id="_474" type="_381" size="32" align="32"/>
  <ReferenceType id="_475" type="_381c" size="32" align="32"/>
  <FundamentalType id="_391" name="char" size="8" align="8"/>
  <ReferenceType id="_478" type="_434" size="32" align="32"/>
  <ReferenceType id="_479" type="_434c" size="32" align="32"/>
  <ArrayType id="_480" min="0" max="3u" type="_25" size="128" align="32"/>
  <ArrayType id="_481" min="0" max="3u" type="_243" size="256" align="64"/>
  <ArrayType id="_482" min="0" max="3u" type="_247" size="256" align="64"/>
  <ReferenceType id="_483" type="_435" size="32" align="32"/>
  <ReferenceType id="_484" type="_435c" size="32" align="32"/>
  <CvQualifiedType id="_276c" type="_276" const="1"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <CvQualifiedType id="_425c" type="_425" const="1"/>
  <CvQualifiedType id="_80c" type="_80" const="1"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <CvQualifiedType id="_302c" type="_302" const="1"/>
  <CvQualifiedType id="_73c" type="_73" const="1"/>
  <FunctionType id="_446" returns="_276">
    <Argument type="_488"/>
  </FunctionType>
  <CvQualifiedType id="_49c" type="_49" const="1"/>
  <CvQualifiedType id="_20c" type="_20" const="1"/>
  <CvQualifiedType id="_434c" type="_434" const="1"/>
  <CvQualifiedType id="_435c" type="_435" const="1"/>
  <CvQualifiedType id="_381c" type="_381" const="1"/>
  <CvQualifiedType id="_174c" type="_174" const="1"/>
  <CvQualifiedType id="_78c" type="_78" const="1"/>
  <CvQualifiedType id="_109c" type="_109" const="1"/>
  <CvQualifiedType id="_110c" type="_110" const="1"/>
  <CvQualifiedType id="_81c" type="_81" const="1"/>
  <CvQualifiedType id="_21c" type="_21" const="1"/>
  <CvQualifiedType id="_238c" type="_238" const="1"/>
  <PointerType id="_403" type="_391" size="32" align="32"/>
  <CvQualifiedType id="_391c" type="_391" const="1"/>
  <FundamentalType id="_425" name="wchar_t" size="16" align="16"/>
  <PointerType id="_427" type="_425" size="32" align="32"/>
  <PointerType id="_488" type="_49" size="32" align="32"/>
  <File id="f0" name="/usr/local/share/gccxml-0.9/GCC/4.5/gccxml_builtins.h"/>
  <File id="f1" name="../vpxmt/include/vpx/vpx_codec.h"/>
  <File id="f2" name="/usr/include/inttypes.h"/>
  <File id="f3" name="/usr/include/stdint.h"/>
  <File id="f4" name="../vpxmt/include/vpx/vpx_image.h"/>
  <File id="f5" name="../vpxmt/include/vpx/vpx_encoder.h"/>
